[
    {
        "name": "An LLM Chatbot in Minecraft with Educational Applications",
        "url": "https://www.researchgate.net/publication/377748743_An_LLM_Chatbot_in_Minecraft_with_Educational_Applications?_sg=s2y9zOdfvZKwpj_eL7IqGS1G-IJWE82s4TWk7_EqrynNMmBO7J1paoIENlBXFi5Gyy5N5AnoDfiHnTc",
        "text": "An LLM Chatbot in Minecraft with Educational Applications  Koya Kudo    Ian Frank  Future University Hakodate  Abstract We  present  the  bot  “Mason”  (Minecraft  AI  Support  ― Objectives  and Novelty) ,   which  leverages  ChatGPT  APIs  to work  with  players  in the  virtual 3D  game  Minecraft. “Mason” can suggest the next task suitable for the current situation through conversation with  the  player  and  observation  of  the  player’s  information.  It  can  also  generate  and customize  structures  such  as  houses  or  furniture  in  the  gameplay  world  by  issuing Minecraft fill commands according to user prompts. Minecraft has uses as an educational tool, and the bot can help with introducing students to the fundamentals of virtual worlds, as well  as promoting  familiarity  with LLMs. Interaction is  language-based  and intuitive, and our framework is general, allowing others to adapt and explore the creative prospects being made possible by the developments in generative AI.  Keywords Chatbots, Digital Collaboration, Spatial Creativity  1. Goals and Background The embedding  of bots in  virtual spaces is  growing  rapidly  and  facilitating  the evolution  of  interactive  interfaces.  We present  Mason  an  LLM-powered  bot  that responds to players via chat in the 3D game MinecraftTM (Mojang Studios, 2023), a video game  that  has  evolved  as  an  educational tool due to the freedom it offers in creating and  exploring  virtual  worlds.  Our  bot  is intended  as  a  tool  to  facilitate communication  and  creativity  via interacting  with  the  player,  presenting tasks,  and  generating  structures  such  as buildings  within  Minecraft  by  leveraging the  power  of  multi-prompt  engineering using LLMs. Also, the Mason framework is available  on  Github  (https://github.com/ koya328/Mason),  and  as  LLMs  evolve  to allow for more creative activity, others  can use Mason  to explore the possibilities. The name  Mason  represents  its  broad  goals: “Minecraft  AI  Support  ― Objectives and Novelty”. Minecraft has two main gameplay modes survival  mode  and  creative  mode,  and Mason  functions  differently  for  each:  In survival mode, Mason can interact with the player and  recommend  actions  for a  given situation by  observing a  player’s  behavior. This  feature  is  useful  in  helping  players develop  appropriate  strategies  for  the different  scenarios  they  may  face.  In creative  mode,  on  the  other  hand,  Mason can  build  structures  based  on  specified prompts and  can add decorations or  make modifications  using  additional  prompts. This  flexibility  allows  the  bot  to  explore creatively,  and helps  with inspiration  and the visualization of new designs.  2. Bot Capabilities in Survival Mode A general  overview  of  Mason’s  dialogue function  in  survival  mode  is  shown  in Figure 1.    Figure 1 Interactive functions overview.  \n The  Chat  Classification  model  initially accepts  a  player’s  utterances  and information  and,  using  few-shot  learning, classifies them into one of three categories: “Chat”, “Order”, and “Request Next Task”.   If  the  utterance  is  classified  as  “Chat”, the Chat  model can  be used  to  respond  to general  conversations  and  questions. This model  employs  RAGs  (Lewis  et  al,  2020) and  can  generate  responses  from  a  large amount  of  data,  even for  information that would normally be impossible to respond to. For example, our primary test environment is the “FUN Minecraft Server” (Kabashima et  al,  2023)  and  Mason  has  been  primed with information to answer questions about its specific conditions.   Examples of an “Order” might be “cut the tree”,  which  would  result  in  appropriate functions  and  arguments  being set  up  via OpenAI’s Function  Calling, and the Action Model  executing  the  result,  such  as mine_block(“oak_log”,3).   A  classification  of  “Request  Next  Task” results  in  analyzing  the  current  situation from  the  player’s  speech  and  information and presenting a suggested course of action to the player. The actions are based on the Voyager  prompt  (Wang  et  al,  2023).  The proposed task is passed to the Action model, which can also assist the player in the task if it can perform the function.  3. Bot Capabilities in Creative Mode For  the  generation  of  structures  in creative  mode,  we  created  an  original prompt  that  is  used to  enable  an  LLM to work with 3D coordinates in Minecraft and to  use  the  fill  command.  A  list  of  fill commands  produces  structures  when executed in sequence.   Figure  2 shows  the  structure  generated in response to the instruction ‘build a house’ on  the  left,  and  the  modified  version resulting  from  the  additional  instruction ‘add a window to the house’ on the right.  Figure 2 Results of structure generation. 3. Conclusions We  have  described  “Mason”  an  LLM-powered  bot  within  Minecraft  that  can function  in  survival  mode  and  in  creative mode.   We  believe  there  are  potential educational applications, such as improving learners’  communication  and  problem-solving skills. Another issue we are working on  is improving  educational suitability  by monitoring  players’  interactions  in  the server  to  identify  and possibly  attempt  to deal  with  undesirable  behavior  such  as confrontational  interactions.  Finally,  as LLMs  improve,  it  is  likely  that  the structure-generating  possibilities  in creative  mode  will  expand,  enabling  the exploration  of  expressive  ideas  in  an interactive  and  online  world,  providing access to a rich creative experience.  References Kabashima, S., Matsuda, K.，Yamamoto, R., and Frank, I. (2023) Building a Better World: Lessons from Setting up, Maintaining and Developing a University Minecraft Server. JSET Autumn Conference 2023 collection papers. pp.597-598 Lewis, P., Perez, E., Piktus, A., et al. (2020) Retrieval-Augmented Generation for Knowledge-Intensive NLP Tasks. NeurIPS Mojang Studios. (2023) Minecraft. https://www.minecraft.net/ja-jp (Accessed December.30.2023) Wang, G., Xie, Y., Jiang, Y., et al. (2023) Voyager: An Open-Ended Embodied Agent with Large Language Models. arXiv preprint arXiv: Arxiv-2305.1629 "
    },
    {
        "name": "Modelling of Virtual Campus Tour in Minecraft",
        "url": "https://www.researchgate.net/publication/378264355_Modelling_of_Virtual_Campus_Tour_in_Minecraft?_sg=4hEGxVlmimqyVrraNbfegwN5MCxyuOFn1jZZa_V6oBZUMNJpiz6Kojhq8-kD7zm4jbl1UZ_ukPSvjgU",
        "text": "Journal of Informatics and Web Engineering  https://doi.org/10.33093/jiwe.2024.3.1.2 © Universiti Telekom Sdn Bhd. This work is licensed under the Creative  Commons BY-NC-ND 4.0 International License. Published by MMU Press. URL: https://journals.mmupress.com/jiwe  Journal of Informatics and Web Engineering Vol. 3 No. 1 (February 2024)       eISSN: 2821-370X  Modelling of Virtual Campus Tour in Minecraft Liyana Tan Lin1, Han-Foon Neo2* 1, 2 Faculty of Information Science and Technology, Multimedia University, Jalan Ayer Keroh Lama, Bukit Beruang, 75450, Malaysia *corresponding author: (hfneo@mmu.edu.my; ORCiD: 0000-0001-5054-3351)  Abstract - Virtual tours have revolutionized the way to explore and experience places from the comfort of our own home. Through advanced technology and immersive digital platforms, virtual tours offer  a compelling alternative to tradition face-to-face  visits. Whether  a  famous  landmark,  museum,  real  estate  or  natural  wonders, virtual  tours  offer  a  unique  opportunity  to navigate and discover  these places  form  a  distance.  Meanwhile,  creating  a virtual  tour  in Minecraft  can  provide  a  unique and  immersive experience that sets the users apart from other virtual tour platforms. Minecraft is one of the most popular video games in the world and boasts a large and dedicated community of players. Using Minecraft for a virtual tour allow users to reach a larger audience who are already familiar with the game, increasing the likelihood of engagement and participation. In this paper, the aim is to create a virtual campus tour in Minecraft to give the visitors an immersive and interactive experience with creative freedom. A series of buildings have been  built  such  as Siti Hasmah Digital Library,  Common  Lecture  Complex (CLC) and Smart Lab.  Visitors  can move around the campus with some gameplay mechanics using mouse and keyboard. Building information was also integrated so visitors  can  see details  about  each building  during  the virtual  tour.  The virtual  tour  provides access,  comfort  and a  sense  of connection to prospective students, their families and international visitors. Additionally, it serves as a low-cost marketing tool that increases engagement, attracts potential students, researchers and staff and ultimately benefits the University’s recruitment efforts. Keywords—Campus, Virtual Tour, Minecraft, Modelling, Engaging experience, Interactivity Received: 20 July 2023; Accepted: 29 August 2023; Published: 16 February 2024 I. INTRODUCTION A virtual tour is a digital simulation of a physical area or environment that allows people to explore and interact with it from a distance. Through the use of multimedia features such as 360-degree photos or films, interactive maps, audio guides  and  educational overlays, a  virtual  tour  allows visitors  to  virtually travel  and  experience places, venues  or events [1, 2, 3]. It strives to provide visitors with a sense of immersion and involvement by simulating the real -world experience as closely as possible. Minecraft offers absolute freedom to build and explore within the game world which allows infinite creativity and imagination. Motivated by this, Minecraft was chosen as the medium for the virtual tour. In this paper, the goals are to create an immersive exploration experience to improve education through useful material, to showcase modernization and to simulate personalized participation. The virtual tour intends to provide an engaging, inclusive and innovative approach for users to connect with the campus environment by exploiting Minecraft’s unique features, ultimately changing traditional campus tours for a tech-savvy generation. To reinvent traditional campus tours, this study aspires to transcend physical boundaries by altering education through immersive experiences  that  guided  by  principles of engagement,  interaction  design  and experiential learning  from \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  16  previous studies [4,  5, 6]. This research transforms the Multimedia  University Melaka Campus into a virtual world within Minecraft. It effortlessly merging digital creativity, interactivity and storytelling guided by various aspects of using technology for educational purposes such as virtual tours, smart buildings and cutting-edge learning platforms [1, 7, 8, 9]. This renovation intends to reimagine how people interact with campus spaces by instilling a stronger bond through  interactive features.  The  interdisciplinary  approach has  anchored  in  architecture, computer  graphics and cognitive  science  that  serves  as  the foundation  for  creating  an  immersive  virtual  tour.  This  research  guided  by educational  technology,  human-centered  design  and immersive  learning principles  in  order  to reshape  traditional campus tours. There are several types of virtual tours accessible, each tailored to a specific setting and purpose. Potential buyers and renters can explore properties online via real estate virtual tours, which provide a detailed perspective of the interior and outdoor spaces [10]. Visitors  can virtually visit museums, landmarks and historical locations, gaining  access to art collections,  artefacts and instructional information through cultural and heritage virtual tours [1, 11, 12]. On  the other hand,  travel  and  destination  virtual  tours  bring visitors  to  various  area across the  world,  highlighting tourist attractions and picturesque landscapes while educational virtual tours are intended to aid learning by allowing students to virtually visit educational facilities, investigate scientific concepts and participate in historical events. In addition to the diverse range of virtual tours accessible, smart building virtual tours are emerging as an innovative technique in  the  field  of  architecture  and  urban  planning.  To  create  immersive  experiences  of  intelligent  and  sustainable structure,  smart  building virtual  tours use  modern technologies  such  as  sensor technologies to  track  human flow, photogrammetry and remote sensing to create immersive experiences of intelligent and sustainable structures [7, 13]. Visitors can take  these  tours  to learn about  the  new  features and functionalities  built  into smart buildings  such  as intelligent  security  systems, energy consumption  and  automation systems  [8, 14, 15].  These  virtual  tours  provide significant insight into the cutting-edge technology employed  in  smart  buildings, promoting a deeper awareness of their environmental and economic benefits of stakeholders such as architects, engineers and potential tenants [12]. While virtual  tours have many advantages,  there are also obstacles and limitations to  the medium. One of the most serious  difficulties  is  the possibility  of  a lack  of  physical presence  and  sensory impressions  [4,  13]. Despite  their immersive properties, virtual tours cannot entirely reproduce the tactile feelings, odours or ambient sounds  that one would experience in an actual environment. This can reduce the overall sensory experience and have an influence on some visitors’ degree of engagement and emotional attachment. There are also some limitations, such as the need for hardware  and  technological  infrastructure  to  enable  the  VR  experience.  Accessibility  problems  such  as  the requirement for specialized equipment may limit the popularity of these visit [4]. The construction of high-quality 3D models  and  immersive  experiences  can  be  time-consuming  and  resource-intensive  [12].  Limited  resources  may prevent these excursions from being widely available, particularly for smaller organisations. Furthermore, techn ical restrictions and changes in user equipment and internet access mighty result in inconsistent performance, such as slow loading times,  buffering  or  bad  image  quality,  which  can  degrade the user experience [5]. Another problem  is  the difficulty  in creating  and implementing  user-friendly  navigation  systems  [16].  Visitors  may  struggle  to  properly explore  the  virtual  environment  without clear and  intuitive  navigation,  resulting in frustration  and  disengagement. Addressing  these  problems  and  continuously  developing  virtual  tour  technology  and  design  will  be  critical  for improving the overall user experience and realising the medium’s full potential. In this paper, the purpose is to create a Multimedia University Melaka Campus model in Minecraft that allows campus virtual tour. Creating a virtual campus tour  in  Minecraft  requires  the  integration  of several technologies, including C++ programming, 3D modelling and user interaction design. It will  help  to further  the study and development of educational solutions that  bridge the gap between gaming,  virtual environment and educational content delivery.  A customized  Minecraft Clone  was  developed  using  C++  and  includes  essential  gameplay mechanics  for  seamless navigation  and  interaction.  The  campus  has  been  carefully  recreated  in  a  Minecraft  environment,  capturing  its architecture  and  key  features. A  number  of buildings  were  being  built  which include  the  Main Gate,  Faculty of Business  (FOB)  Building,  Faculty  of  Engineering  (FET)  Building,  Faculty  of  Law  (FOL)  Building,  Faculty  of Information Technology and Science (FIST) Building, Smart Lab of FIST, Tennis  and Badminton Court, Mosque in the Campus,  Common  Lecture  Complex (CLC), Gym  Room,  Plaza  Siswa,  Block B,  Siti  Hasmah  Digital  Library, Main Hall and 24-Hours Students’ Learning Point. Building information was integrated so visitors can access details about each building during a virtual tour. A user-friendly interface and intuitive controls are implemented to ensure a smooth experience. This evaluation confirmed the project’s success in providing an immersive and informative virtual tour.  \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  17  A  virtual  MMU  campus  tour  in  Minecraft  emerges  as  an  innovative  tool that  perfectly  blends  technology  with experience learning in a quickly expanding digital context. It aims to improve visitors’ experience and allows them to gain a  better  knowledge of how the  campus is laid out.  Unlike static brochures or  movies, this interactive platform allows prospective students, parents and stakeholders to connect with the school environment on their own terms. It also enables accessibility by allowing prospective students, parents and other stakeholders to experience the campus from a distance. This saves time and money on physical visits and making it easier for visitors to see several campuses. Minecraft’s  immersive  nature  allows  players  to  traverse,  investigate  and  interact  with  architectural  subtleties, developing  a  deeper  sense  of  connection  and  knowledge.  This  technologically  driven  approach  out  not  only modernizes the traditional campus tour, but it also coincides with the digital fluency demanded in today’s educational scene. By  leveraging Minecraft’s immense popularity, educational institutions may display  their campus, amenities and values in  a way that appeals to a tech-savvy age, ultimately  altering how individuals explore  and connect with educational places. The organisation of the paper is as follows. Section II reviews the related study of virtual campus tour while research methodology is presented in Section III. Campus tour screen design and proposed solution are entailed in Section IV. Section V presented User Acceptance Test to compare pre-test and post-test results that were conducted in different time. Subsequently, it is followed by discussion in Section VI. Finally, conclusion is presented in Section VII along with limitations and future directions.   II. RELATED STUDY Virtual  tours  have  arisen  as  a  dynamic  and  immersive  approach  to  explore  virtual  environment  in  game-based platforms [17]. Platform such as Roblox and Minecraft offer dynamic environments in which users may create, explore and interact with virtual worlds. These game-based virtual tours provide distinct  benefits  such  as the possibility to include  gameplay,  narration  and  social  involvement.  The  ability  to  create  detailed,  visually  stunning  virtual environments improve the whole experience. Furthermore, interactive aspects enable viewers to travel, interact with objects and engage with others, making the tour more interesting and memorable. Virtual tours based on games can also  be  educational,  encouraging  learning  and  critical  thinking  in  disciplines  such  as  history,  art  and  science. Furthermore, the accessibility of game-based platforms makes virtual tours more accessible to a broader audience, allowing  for  greater  inclusivity.  As  game-based  platforms  evolve,  virtual  tours  have  enormous  potential  to revolutionise  how people  explore  and  interact  with  virtual  environments,  creating  innovative  and  transformative experiences [18, 19]. Several studies have delved into the possibilities and potential of  virtual tours in  a diverse of contexts, highlighting user perceptions, learning experiences and their impact on the tourism industry. Suwarno and Nerru Pranuta Murnaka [16] focused on student perceptions of virtual campus tours as an alternative to physical campus visits. The authors explored the use of virtual environments to provide students with an immersive and interactive experience on campus. They  discussed  the  benefits  and  limitations  of  virtual  campus  tours,  considering  factors  such  as  visual  fidelity, navigation  and  information  availability  that  contributed  to  student  perception  and  participation.  The  review highlighted the positive impact of virtual tours that had on student decision-making processes, as they allowed students to explore campus facilities, infrastructure and amenities remotely. They have highlighted the importance of creating realistic  and  user-friendly  virtual  environments that  accurately  represent  the physical  campus  to  improve student perception  and  belonging. Their  findings  have  helped universities  understand  the  role of  virtual  campus tours  in attracting and engaging prospective students and helped universities improve virtual tours and adapt to the changing needs and preferences of students in the digital age. At the same time, Rey Luis Arauho` Castillo et al. [11] investigated the use of virtual tours as an educational tool to improve learning experiences and student engagement. This review highlighted the benefits of virtual museum tours that allowed access to  cultural  and  historical  artifacts from around the world, regardless  of geographic restrictions. The  authors  emphasised the  interactive  nature  of the  virtual  tour,  which  allows students  to  explore the  museum, examine artifacts and access detailed information through multimedia presentations and virtual guides. They discussed integrating  virtual  tours  into social  science  education and promoting  active  learning, critical  thinking and cultural awareness. The review also addressed challenges and considerations related to virtual museum tours, such as the need for a suitable technological infrastructure, user-strategies to maximize learning outcomes. The findings contributed to \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  18  our understanding of the educational potential of virtual museum tours in social science education, highlighting their ability to engage students, broaden their cultural horizons and promote meaningful learning experiences. Osman  El-Said and  Heba  Aziz  [10]  explored  the  impact  of  travel  restrictions  and  social  distancing  measure  on traditional tourism practiced and explored the potential of virtual tours as an alternative way to experience destinations remotely. They discussed  the benefits of virtual  tours in terms of accessibility, convenience and  security that allow individuals to explore and connect with destinations virtually from the comfort of their own homes. This highlighted the immersive and interactive nature of virtual tours, which provided a realistic and engaging experience through the use of virtual tours, which provided a realistic and engaging experience through the use of technologies such as 360-degree video and augmented reality. This  study highlighted the  importance of  virtual tours as  a tool for destination marketing and promotion, allowing tourism organizations to showcase their products and attract potential visitors. Besides the research on the real-world virtual tours, some articles that related to virtual tour and modelling in video-game  engine  also  being discovered.  Cecile Meier  et  al.  [9] discovered  the potential  of  game-based  platforms like Roblox to engage  and provide an immersive learning environment. The  authors discussed the process  of designing virtual tours that allow  users to explore and learn about their sculptural heritage in an  interactive and fun way. This review highlighted the benefits of using gameplay mechanics, storytelling elements and social interaction features in virtual  tours.  They also  addressed  educational  benefits such as  increased  motivation, engagement  and  knowledge retention. This research also highlighted the potential of game engines like Roblox to democratize access to cultural heritage and  promote  a  deeper understanding  and  appreciation  of  the sculptural  arts.  The  result  contributed to  the understanding of how  game-based  platforms can be used as effective  educational  tools  to  explore  and  learn  about cultural heritage and to develop innovative approaches to cultural heritage education and virtual tours. Correspondingly,  Nolan  et  al.  [20]  demonstrated  a  unique approach to modelling a metasmart  city  on  Mars  in  the Minecraft virtual world. The researchers wanted to use the game’s creative capabilities to explore the possibility of using virtual environments to simulate and design future smart cities in extraterrestrial habitats. This paper described the  methodology  used  to  build  virtual  cities  and  focused  on  the  integration  of  advanced  technologies  such  as automation, artificial intelligence and sustainable energy systems. The study highlighted the importance of considering various  factors  such  as  resource  management,  environmental  sustainability  and  human-centered  design  when developing smart cities, even in extreme environments. This research provided valuable insight into the application of virtual platforms like Minecraft as tools for imagining and planning future Smart City infrastructure on Mars. By  exploring  the potential  of  virtual environments  in  Roblox’s  extraterrestrial  habitat  exploration  and  immersive cultural heritage  learning and Minecraft, these studies collectively foster innovation and support in diverse research and  educational  engagements.  It  demonstrates  the  transformative  power  of  game-based  platforms.  Virtual  tours focused in campus or University settings are limited in the literature, and in this paper, the aim is to create a virtual campus tour based on  Multimedia University to engage students from everywhere to explore the campus’ facilities, buildings and infrastructure.  The authors of previous research by Chang et al. [6] use a network perspective to examine the effect of virtual tours on urban visitors.  This study intends to offer information on  how virtual tours affect  tourists’ interactions with and impressions of urban settings. The authors investigate the complex relationships that develop between visitors and their participation in virtual tours using a network analysis methodology. The study emphasizes the  value of virtual tours as instruments for improving the exploration and understanding of urban settings, even when the details of the virtual tour platform are not covered in the material that is presented. This article advances knowledge about how technology-mediated experiences, including  virtual tours influence  the activities and interaction of tourists in urban settings. Meanwhile, Garcia  et  al.  [21]  focuses on the  creation  and  application  of a playable 3D virtual  tour  created  for  an engaging campus visit experience. In order to draw potential students to the institution, the authors want to highlight the school’s facilities. This study highlights the potential of using virtual tours to engage potential students and provide them an in-depth investigation of campus infrastructure and facilities by creating an immersive and interactive virtual environment. The authors  offer  insights  into  the  process  of  producing a visually appealing and  educational  virtual campus tour by integrating technology  like 3D modelling and  interactive features. The emphasis on the function of virtual tours in  campus  exploration  and  higher  education marketing makes  this  work  a  contribution  to  the  field  of virtual reality research. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  19  These articles have jointly contributed to the growing field of virtual tours by demonstrating how they are used in a variety of contexts such as urban environments and educational organisations. While Change et al. [6] explores how virtual  tours  affect how  urban  visitors engage  with  one  another  from  a  network perspective,  3D  virtual  tour was implemented by Garcia et al. [21] to engage and enlighten prospective students about campus amenities in order to draw them as students. There was a collection of research efforts that are inextricably linked to the current study’s objectives of producing a virtual  campus  tour  for  Multimedia  University.  Suwarno  and  Nerru  Pranuta  Murnaka  [16]  investigate  student impressions of virtual campus tours, which corresponds to the current research’s emphasis on engaging prospective students through immersive experiences. Similarly, Rey Luis Arauho Castillo et al. [11] investigate the pedagogical potential of virtual museum tours, emphasizing interactive learning and interaction inside a virtual setting. Osman El-Said and Heba Aziz [10] emphasise the accessibility and immersive character of virtual tours, which is consistent with the current study’s purpose of providing an alternate way to experience campuses. Cecile Meier et al. [9] findings on game-based platforms and interactive learning are consistent with the study’s objective to use Minecraft to create an engaging virtual campus tour. Furthermore, Nolan et al. [20] demonstrate the novel application of virtual worlds such as Minecraft, which aligns with the current research’s use of the platform to revolutionise campus exploration. These studies  provide  techniques  and  inspire  future  approaches  for  the  current  study,  all  of  which  contribute  to  the transformative potential of game-based virtual tours.  Table 1 below shows the comparison table of literature review.  Table 1: Comparison table of literature review Year  Title Authors Focus Key Findings 2020 The  tours in  virtual  museums  a didactic  opportunity  in  social sciences Rey  Luis  Araujo Castillo  and Xiomara  Deysi Linares Zegarra Educational value of Virtual  Museum Tours Involving  pupils  and encouraging  critical thinking, active learning and  cultural  sensitivity. Difficulties  with learning  methods  and technology infrastructure. 2020 Students'  Perceptions  of  360 Degree  Virtual  Tour-Based Historical  Learning  About  the Cultural  Heritage  Area  of  the Kapitan  and  Al-Munawar Villages in Palembang City Abidin,  R.,  & Suryani, N. Learning  history on a 360 degrees virtual tour. Explore  students’ perception  of  history learning  through  360 degrees  virtual  tours that  highlight  their potential  for educational engagement. 2020 Virtual  tours  and  informational models  for  improving  territorial attractiveness  and  the  smart management  of  architectural heritage: The 3d-imp-act project. De  Fino,  M., Ceppi,  C.,  & Fatiguso, F. Virtual  tours  for architectural heritage management. Study  virtual tours  and informative  models  to improve  the management  of architectural  heritage, contributing  to  the attractiveness  of  the territory. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  20  2020 Virtual  Campus  Tour  (Student Perception  of  University Virtual Environment) Suwarno  and Nerru  Pranuta Murnaka Student’s perception on  Virtual  Campus Tour. Positive  impact  on student  perspective  and decision-making.  The significance  of developing  realistic, user-friendly  virtual environments. 2020 Using  the  Roblox  Video  Game Engine for Creating Virtual tours and  Learning  about  the Sculptural Heriatge Cecile  Meier, Jose  Luis  Saorin, Alejandro Bonnet de Leon, ALberto Guerrero Cobos Game-based platform  for engaging learning Immersive  learning environments  that  use interactive  features  and gaming  dynamics. Improved  involvement, motivation  and knowledge. 2021 Modelling a  Meta Smart City on Mars in Minecraft Anthony & Emily Nolan,  Ryley Nolan,  and  Flynn Nolan Future  smart  city designing  in  virtual environment  using Minecraft. Use  of  virtual environment  with Minecraft to  mimic and create  smart  Martian cities.  Combining cutting-edge technology  with human-centered design. 2022 Virtual Tours a Means to an End: An  Analysis  of  Virtual  Tours’ Role  in  Tourism Recovery  Post COVID-19 Osman  El-Said and Heba Aziz Virtual  tourism replaces  traditional tourism. Virtual  tours  are convenient,  secure  and easily  accessible. Experiences  that  are immersive  and engaging  using  tools like  augmented  reality and 360-degree video. 2022 Freshmen  Orientation  Program Using  Minecraft:  Designed  by Students for  Students  during  the Covid-19 Pandemic S.  Supraja,  S. Tan, F. S. Lim, B. Koon  Ng,  S.  Y. Ho and  A.  W.  H. Khong Minecraft-based freshmen orientation programme The use of Minecraft to guide  freshmen  by demonstrating  the  use of  technology  to improve engagement  in campus activities. 2023 A  Playable  3D Virtual  Tour  for an  Interactive  Campus  Visit Experience:  Showcasing  School Facilities  to  Attract  Potential Enrollees M.  B.  Garcia,  D. M. C. Mansul,  E. B.  Pempina,  M. R. L. Perez and R. T. Adao Virtual  Campus  Tour in 3D Playable for  Interactive Campus Visit Making  an  interactive 3D virtual tour to  show prospective students the facilities  at  the  school. Put your energy towards enticing potential pupils with  an  immersive experience. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  21  2023 The  influence  of virtual  tour  on urban  visitor  using  a  network approach Chang,  M.,  Lee, G. B.,  Lee,  J.  H., Lee, M., & Lee, J. H. Virtual  tour’s impact  on  Urban visitors Using  a  network approach  to  examine how virtual tours affect tourists in urban cities.   III. RESEARCH METHODOLOGY The research started with the data collection that involving the capture of approximately 20 pictures for each building within  the  campus.  The  picture  has  been  taken  from  all  angles  and  making  sure  to  capture  the  unique  design, architecture marvels and every little details that makes each building stand out. The whole process has taken around three  months  until the end  of  the research.  Following  the extensive  data collection  phase,  the research  technique entailed a methodical and technological approach to create the virtual campus tour in Minecraft. The project continued by creating a  Minecraft  clone by constructing a 3D  world  populated with various types of  blocks  using procedural methods.  The  development of  Minecraft  clone was  established  within  a  C++  framework,  further  enriched by  the integration of C language, OpenGL and HTML. In the Minecraft clone, players can control their character’s movement and  actions  from  a  first-person  perspective  using  keyboard  and  mouse.  After  that,  the  campus  of  Multimedia University was carefully recreated in the Minecraft environment, capturing its architecture and key features. The world and blocks chunks will then be saved inside a database and ready to be use inside the virtual tour. With this, visitors can explore the world and discover more information about the buildings inside the virtual world.  The most crucial step was the thorough recreation of the Multimedia University Melaka Campus within the Minecraft. Architectural authenticity was of the utmost importance, ensuring the  buildings, landmarks and spatial  layout  were accurately depicted. There was a total of 15 buildings were built in  the virtual campus tour and  it takes around five days for each location to be build.  To  accomplish  this,  a  texture  atlas  which  was an image file comprising several small textures arranged in a grid pattern was used to generate the blocks in the game. There were 24 blocks including Grass, Stone, Cobblestone, StoneBricks, CarvedStone, OakLeaves. SpruceLeaves, OakLog, Cactus, Sand, OakPlanks, AcaciaPlanks,  DarkOakPlanks,  Bricks,  GlassWhite,  LampOn,  LampOff,  WoolRed,  WoolGreen,  WoolBlue, WoolYellow,  Gravel  and Clay  were  generated. Each  type  of  the block  had  a corresponding  texture. The  method created a list of block textures and loops through them, retrieving texture coordinates from the texture atlas and saving them  in  a  database.  In  order  to augment  the  visual quality  of  these blocks,  specific  shaders  coded in  GLSL  were incorporated into the fabric of the project and capitalizing on the robust capabilities of OpenGL. Moreover, the project harnessed the potential extension including GLEW for accessing OpenGL functions, GLFW for window management and GLM for mathematics foundation for the virtual world in the Minecraft clone. Figure 1 below shows the types of textures of different blocks in the Minecraft clone. Figure 1 shows the types of Minecraft blocks. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  22   Figure 1: Types of Minecraft blocks To achieve seamless user engagement within  the virtual campus  tour in Minecraft,  an intuitive gameplay mechanic was required. The implementation of the gameplay mechanics was executed to enable fluid movement and interaction within the virtual tour. This indicates handling keyboard and mouse input for movement, camera control and actions like placing and destroying the blocks. The snippet of pseudocode below is a collection of conditional statements that react to certain button pushes and activities within the virtual tour. Each IF statement checks to see if a specific button is being pressed and if the condition is met, it performs the related action. From line 1 until line 6 of the pseudocode, visitor  will  go ahead  if  the  “W” button  is  pushed. The  visitor  will  travel backward  if  the “S”  button  is pressed. Similarly, the “A” and “D” buttons will move the visitor left and right respectively. The visitor can fly if the spacebar is pressed and it can move downhill if the shift key is pressed. Line 7 and 8 of the pseudocode also provides actions dependent on the state of the “action” variable. When the variable is set to “RightKeyPress”, it indicates that the user intends to destroy a block. If the “action” variable is set to “LeftKeyPress”, the user intends to place a block. Overall, this pseudocode captures button-based interactions as well as the equivalent in-game action for visitor movement and object  manipulation.  These  components  came  together  to  create  a  realistic  and  engrossing  virtual  tour  by demonstrating  the  successful  fusion  of advanced  technology. Figure  2  shows  the  pseudocode for  movements  and events. 1. IF (button W is pressed)  THEN move forward ENDIF  2. IF (button S is pressed)  THEN move back ENDIF  3. IF (button A is pressed)  THEN move left ENDIF  4. IF (button D is pressed)   THEN move right ENDIF  \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  23  5. IF (button space is pressed)  THEN fly ENDIF  6. IF (button shift is pressed)  THEN go down ENDIF  7. IF (action==RigthKeyPress) THEN destroy the block; ENDIF  8. IF (action==LeftKeyPress) THEN place the block;   ENDIF  Figure 2: Pseudocode for movements and events   Figure 3 shows the action of placing and destroying the blocks in the Minecraft environment.  Figure 3: Placing and Destroying the blocks Subsequently, data permanence was also handled to provide consistent user experiences. The pseudocode below was responsible for saving the state of the Minecraft world. Line 1 of the pseudocode iterates through each block in the world data collection using a FOR loop. Line 2 will check for changes in either the block states or the light card status within the loop. If modifications are detected in line 3,  the block data and worlds  data will be saved in “world.bin” and the player  data  will  be  saved  in “player.bin”.  The  method  returns  true to indicate that the  saving  process  was successful after processing  all of the blocks and successfully saving the data.  However, if an  exception  or problem occurs during the file writing operations in line 4, line 5 will show an error message indicating that the data could not be saved and return false indicating that the saving procedure failed. Overall, the pseudocode demonstrates a simple algorithm for iterating  through  world data, detecting changes and successfully  storing the necessary  information  in distinct binary files while ensuring data integrity through error handling. Figure 4 shows pseudocode  for saving the world \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  24  1. FOR each block in world data 2. IF block states OR light card status changed 3. THEN write block data into \"world.bin\"   write player data into \"player.bin\"    write world data into \"world.bin\"  RETURN true  END IF 4. CATCH Exception as e  5. DISPLAY error message for not saving the data  RETURN false  END FOR Figure 4: Saving the world One  important  goal of  the virtual  tour was  to increase user  involvement through  interactive  building information displays. The pseudocode below displayed a message box with information about library when the visitor is in front of it. Line 1 shows a loop that iterates through each position in the list of positions. Line 2 checks whether the current place in the iteration is labelled as library within the loop. If the condition is true and the position is truly marked as library, line 3 will display a message box with library information. The message box provides the visitors with specific information about the library. This loop will continue to iterate through all positions in the list of positions and anytime it  comes  across to  other  buildings  in  the virtual  tour,  it will  display  the  message  box  with  the matching building information. Figure 5 shows the pseudocode for displaying the message box. 1. FOR (position in list of positions)  2. IF (list of position == library) THEN   3. DISPLAY message box with library information;  END IF    END FOR Figure 5: Pseudocode for displaying message box Several limitations occurred during the development process. To ensure a smooth gameplay experience, performance had to be optimized especially while producing large-scale environments. To ensure architectural precision, complex building structures necessitated exact block arrangement. To address these issues, optimization techniques were used and a careful  balance of visual accuracy and  performance was attained. Furthermore, coordinating interactions and displaying information necessitated an intuitive user interface design that was iteratively updated based on user testing feedback.  IV. CAMPUS TOUR SCREEN DESIGNS \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  25   Figure 6: Homepage of the system prototype Figure 6 shows the homepage design of the  system prototype.  There  are  three  buttons  in  the  homepage. Play is to proceed to the next step. Help and about is some guideline for user to refer before start the virtual tour. Exit is to exit the system prototype.  Figure 7: Help and about of the system prototype Figure 7 shows the help and about that use to guide the visitor on how to move around the campus during the virtual tour. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  26   Figure 8: Menu page of the system prototype Figure 8 shows the menu page of the system prototype. Visitor can choose the location they want to view or click on the back button to go back to the homepage. Meanwhile, Figure 9 until Figure 23 will the snapshot of the campus building in the virtual campus tour in Minecraft.  Figure 9: Main Gate of MMU Melaka campus Figure 9 shows the main fat of MMU Melaka campus. There is a guardhouse to ensure student and staff’s safety. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  27   Figure 10: Faculty of Business (FOB) Building Figure  10  shows  the  building  of  Faculty  of  Business  (FOB)  which  is  a  purpose-built  building  for  academic programmes, faculty dean offices, classrooms and administrative offices that connected to business and management disciplines.  FOB  plays  an  important  role  in  the  education  and  development  of  future  business  executives  and professionals. It fosters business education, research and the development of leadership and entrepreneurial skills.   Figure 11: Faculty of Engineering (FET) Building Figure  11  shows  the  building  of  Faculty  of  Engineering  (FET)  which  is  a  dedicated  facility  that  designed  to accommodate engineering-related academic programmes, faculty dean offices, laboratories and administrative offices. Within the campus, it acts as a hub for engineering instruction and research. It fosters hands-on learning, innovation \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  28  and  the  development of  cutting-edge  technology  while educating  students  for careers  in  a variety  of  engineering specialties.  Figure 12: Faculty of Law (FOL) Building Figure 12 shows the building of Faculty of Law (FOL) which is dedicated building that houses academic programmes, faculty dean offices, tutorial classrooms, law library, e-moot court and administrative office relating to law and legal education.  FOL  plays  an  important  role  in  the  teaching  and  training  of  future  legal  practitioners.  It  offers  a comprehensive and specialized environment for legal education, research and community participation, encouraging students and faculty to develop legal knowledge and professional skills.  Figure 13: Faculty of Information Science and Technology (FIST) Building \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  29  Figure  13  shows  the  building of  Faculty  of  Information Science  and  Technology  (FIST). It  is  a  dedicated  facility designed to accommodate information science and technology academic programmes, faculty dean offices, research labs, smart lab and administrative offices. FIST building house multiple academic departments relevant to information science and technology.  Computer  science,  information  technology,  life  science  and  other  related subjects may be included.  Figure 14: Smart Lab of FIST Figure 14 shows the Smart Lab of FIST. There are plenty of table and chairs that arranged in groups to make students make discussion more easily. Every group will have one smart board to present and share their ideas during the class.  Figure 15: Tennis and Badminton Court \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  30  Figure  15  shows  the tennis  and  badminton  court  of the  MMU  campus. Both  Tennis  and  Badminton  courts  give possibilities for physical fitness, skill development and social contact for students. They foster an active and healthy campus lifestyle and contribute to the school community’s general well-being. Furthermore, these facilities can serve as a hub for sports organisations, intramural tournaments and leisure leagues in order to help students develop a sense of community and camaraderie.   Figure 16: Mosque in the campus Figure 16 show the mosques of MMU campus. The mosque is where all the Muslim students, lecturers and staff can gather for religious  worship,  prayer  and  community  activities.  It  is not simply a symbol  of  religious  diversity  and inclusion but it is also a valuable resource for Muslims. It offers a place for spiritual reflection and growth while also adding to the cultural diversity of the campus area.  \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  31  Figure 17: Common Lecture Complex (CLC) Figure 17 shows the Common Lecture Complex (CLC). It is a building that gather all the lecture hall that allow student to have their daily lecture class. A tiered  or slanted seating  configuration  is used in all the lecture hall to ensure all students have clear sightlines to see the projector screen and whiteboard during the class.  Figure 18: Gym Room Figure 18 shows the Gym room of the campus. Gym room is one of the facilities inside the campus that dedicated to encouraging physical fitness and well-being among students, lecturer and staff. It is an excellent resource for students who want to be fit and stress-free while pursuing their studies.  Figure 19: Plaza Siswa \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  32  Figure 19 shows the  building  of  Plaza  Siswa  which  is  a multifunctional  facility  that  is built to meet the  needs  and convenience of students, lecturers and staff on a daily basis. It houses a variety of amenities and services such as café, convenient store, ATM machines, printing shop and more that improve the quality of life on campus.  Figure 20: Block B Figure 20 shows the building of Block B  where it  houses  computer  laboratories and  diploma  centres. It  acts  as  an important academic and support hub for  students  pursuing  diploma  programmes  and  needing  access to specialized computer resources. Block B plays an important role in creating a friendly and appropriate environment for diploma students. It ensures that they have access to the resources, assistance and services they need in order to excel in their academic endeavours as well as preparing them for future employment or further education.  Figure 21: Siti Hasmah Digital Library \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  33  Figure 21 shows the building of Siti Hasmah Digital Library. It is a three-floor library that provides digital and physical access to a  wide  range  of  academic  publications such as books, journals, research  papers,  multimedia  content  and other educational tools.   Figure 22: Main Hall Figure 22 shows a main hall on the campus where it is versatile and necessary venue for a range of functions such as examination, events, ceremony and meetings.  Figure 23: 24-Hours Students’ Learning Point Figure 23 shows the  24-Hours  Students’  Learning  point with air conditioning on campus. It  is a great resource for students  where  the  learning point  provides  a comfortable  and  conducive atmosphere  for  them  to study,  work  on assignments and having group discussion on their group projects even outside the library or lecture hours. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  34   Figure 24: Building description on the blue stone Figure 24 shows the building description on the blue stone. This is what the user will see when they go nearer to the blue signboard. A message box will come out and display the building name and description.  Figure 25: Pause page of the system prototype Figure 25 shows the pause page of the system prototype. User can click on escape key to pause the system prototype. In this page, user can choose to resume the virtual tour or quit the virtual tour. If user choose the quit the virtual tour, they will be redirect to the homepage of the system prototype.  \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  35  V. USER ACCEPTANCE TEST A preliminary survey was conducted to examine the user acceptance of the proposed virtual campus tour. It consisted of  pre-test  and post-test.  The  former  was  administered  prior  to  the  creation of  the  virtual  tour  and the  latter was administered following the  completion of the virtual tour. The goal  was to learn how participants’ impressions and ratings changed after they took the virtual tour. The evaluation criteria included a variety of aspects that contributed to participants’ views and degrees of satisfaction with the virtual campus tour in Minecraft. In both the pre-test and post-test questionnaires, these factors were evaluated using five-point Likert-scale ratings. The following metrics were considered: 1. Overall experience: Participants rated their overall experience with the virtual tour, indicating how much it captures and interested them. 2. Simplicity of navigation: Participants evaluated the virtual tour’s simplicity and intuitiveness, indicating the platform’s user-friendliness. 3. Informativeness of  various  locations  and services: This criterion  assessed  participants’ perceptions  of  the virtual tour’s ability to provide detailed and relevant information about various sites and services on campus. 4. Likelihood of referral:  Participants indicated their chance of  suggesting  the virtual tour to  others based on their personal experience. 5. Overall satisfaction: This metric assessed participants’ overall satisfaction with the virtual tour, taking into account all areas of their platform interaction. 6. Improvement of user experience: Participants rated whether the virtual tour improved their overall experience when compared to traditional campus tour. In the  pre-test questionnaire,  there were a  total of 31 participants  who have contributed to  the user acceptance test. 38.7% of them were male and 61.3% were female. Most of the participants’ ages were in the range of 18-21 years old which stands for 58.1% (18 people). The second large group of participants were from the age range of 22-25 years old which stands for 29% (nine people). While the other 12.9% were in the range of below 18 years old (four people).  Meanwhile in the post-test questionnaire, there were a total of 30 participants who have contributed, 46.7% of them were male and 53.3% of them were female. Most of the participants’ ages were in the range of 22-25 years old which stands for 60% (18 people). The second large group of participants were from the age range of 18-21 years old which stands for 26.7% (eight people). The third large group of participants were from the range of 26-29 years old which stand for 10% (three people). While the other 3.3% was stand by the range of below 18 years old (one people). Figure 26 shows the participant’s demographic profile.  Figure 26: Participants’ demographic profile \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  36  The results, as  shown  in the table below, highlight  the  mean values collected from each questionnaire  that  provide insights into the impact of the virtual tour on participants’ impressions and levels of satisfaction. Furthermore, standard deviations show the distribution of replies inside each questionnaire, indicating the extent of agreement or difference among participants’ judgements. Table 2 below shows the mean and standard deviation for pre-test and post-test. Table 2: Mean (µ) and Standard Deviation (σ) for Pre-test and Post-test Metrics Pre-test  Post-test  Pre-test  Post-test  µ σ Overall Experience 4.6129 4.7667 0.7902 0.4230 Ease of navigation 4.4516 4.7667 0.7551 0.5588 Informativeness of Different Areas and Facilities 4.1935 4.6000 1.1478 0.7118 Likelihood of Recommendation 4.4652 4.7667 0.6978 0.4230 Overall Satisfaction 4.2903 4.8000 0.9901 0.4000 Improvement of User Experience 4.5161 4.7667 0.9113 0.4955  In the  pre-test  questionnaire,  participants scored several features of  the campus idea. The following  were the mean values for each  metric:  4.6129 for overall experience, 4.4516  for ease of navigation, 4.1935  for  informativeness of different areas and facilities, 4.6452 for likelihood of recommendation, 4.2903 for overall satisfaction and 4.5161 for improvement of user experience. The standard deviations ranged from 0.7551 to .1478, demonstrating some variation on the responses of participants within each metric. Meanwhile, participants reviewed their experience with the actual execution of the campus virtual tour using Minecraft in the post-test questionnaire. The following were the mean values for each metric: 4.7667 for overall experience, 4.7667 for ease of navigation, 4.6 for the informativeness of various sections and facilities, 4.7667 for likelihood of recommendation, 4.8 for overall satisfaction and 4.7667 for improvement of user experience. The standard deviation varied from 0.4 to 0.7118, showing that response variability was lower than on the pre-test questionnaire. When the mean values of the two questionnaires were compared, it was discovered that the mean ratings for all metrics increased in the post-test questionnaire, showing an overall improvement in participants’ opinions after witnessing the campus  virtual  tour.  Notably,  higher  mean  ratings  in  the  post-test  for  “overall  satisfaction”  and  “likelihood  of recommendation” with mean values of 4.8 and 4.7667 were observed respectively. When the standard deviations are examined, it is discovered that the post-test questionnaire had less variability than the pre-test questionnaire. This shows  that  in the post-test,  participant  responses were more consistent, reflecting a more united perception of the campus virtual tour experience. The findings show  that implementing the campus virtual  tour in Minecraft had a beneficial impact on participants’ views and levels of satisfaction. The higher mean ratings and lower standard deviation in the post-test questionnaire indicate  that  the  virtual  tour  improved  the  overall  experience,  ease  of  navigation,  informativeness  and  overall satisfaction with the campus virtual tour idea.  An empirical study was conducted in order to investigate the influence of using Minecraft as a virtual tour platform on a university campus. This study evaluates the changes in participants’ views and satisfaction levels before and after seeing the virtual campus tour in Minecraft using a paired sample t-test analysis. Table 2 shows the calculated mean differences, standard deviation differences, t-statistic and two tailed p-values for the metrics mentioned previously. It illuminating the statistical significance of the observed changes. Table 3 below shows the paired t-test results.  \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  37  Table 3: Paired t-test results Metrics Mean Difference Standard  Deviation Differences t-statistic two tailed p-value Overall Experience 0.1538 0.6932 1.948 0.062 Ease of Navigation 0.3151 0.6866 2.655 0.013 Informativeness 0.4065 0.8792 2.044 0.050 Likelihood of Recommendation 0.3015 0.5256 3.234 0.003 Overall Satisfaction 0.5097 0.7830 3.969 < 0.001 Improvement of User Experience 0.2506 0.8076 1.722 0.095  The p-values in this table are the two-tailed p-values for a t-distribution with 30 degrees of freedom. These p-values represent the likelihood  of encountering a  t-statistic, assuming  no significant change between the pre-test and post-test averages.  Lower p-values indicate greater statistical significance. A  p-value of less than 0.05 which  are ease of navigation, likelihood of recommendation, overall satisfaction and  improvement of user  experience are regarded as statistically significant. Overall, the paired sample t-test empirical research provides useful insights on the effectiveness of using Minecraft as a  virtual  tour platform  for  a campus  environment. The  study  found  statistically  significant increases  in  numerous important areas, including ease of navigation, referral likelihood  and overall satisfaction. These  data imply that the virtual  tour  developed  in  Minecraft  has  improved  user  friendliness,  increased  the  likelihood  of  participants recommending the tour to others and boosted overall satisfaction. While not all metrics reached statistical significance, the  data  patterns  shows  that  other  criteria  such  as  overall  experience,  informativeness  and  user  experience enhancement are heading in the right direction.  VI. DISCUSSION This paper has successfully presented a campus model in Minecraft, enabling an interactive virtual tour of a university campus.  The  user  experience  is  enhanced  by  leveraging  gaming  dynamics  and  architectural  data,  allowing  for immersive  exploration  of  the campus  area.  While  real-time interactions  and dynamic  events  are  currently limited, iterative  improvements  have  been  driven  by  user  input.  This  technique  is  consistent  with  the  conclusions  of comparable research such as Suwarno and Nerru Pranuta Murnaka’s [16] study of student views of university virtual environments. Future directions include multiplayer functionality, dynamic elements and expansion of the project to other agencies. This project  demonstrated  the  potential  of  gamified  environments and virtual  tours  for  educational purposes with an emphasis on immersive experiences in campus exploration and participations. When the visitor enters the system, a  homepage with three buttons, “Start”, “Help and Options” and “Quit” will  be displayed. When visitor click on the “Start” button, it will proceed to the main menu page. But if visitor clicks on the “Help and Options” button, it will show all the instruction for visitor to use in the virtual tour, and “Quit” button is for visitor to quit the system. After visitor choose to  click on “Start” button, the main menu page with university  name will be displayed on the page. Visitor can choose the university that the visitor wishes to view in the virtual tour. The virtual tour will be displayed. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  38  Visitor can move freely in the virtual tour by using WSAD key to move front, back, right and left. Visitor can also fly up  by  pressing  space  key and  go  down  to the  floor  by  pressing  shift key.  This  arrangement promotes  freedom  of exploration, allowing visitors to easily navigate the campus area. Notably, the incorporation of flying controls in the navigation system of the virtual tour adds a new dimension, allowing users to freely explore the campus layout from various perspectives.  This unique feature is similar to the study  conducted by Supraja et al. [5], in  which Minecraft was  used  for a  freshmen orientation  programme.  From the  main gate  of MMU, visitors  can  move to explore  the building for faculty such as Faculty of Business (FOB), Faculty of Engineering (FET), Faculty of Information Science and Technology (FIST) and Faculty of Law (FOL). Visitors also able to explore all the facilities and building such as Administration  Office,  President  Square,  Library,  Learning  Points,  Plaza  Siswa,  Gym  Room,  Security  Building, Tennis Court, Basketball Court, Field and more. This thorough research is consistent with the findings of Radianti et al. [4], who emphasized the instructional benefits of immersive virtual  reality applications in higher education. The virtual  tour’s  in-depth  exploration  parallels  the educational  opportunities  discovered  in  their  research, promoting increased familiarity with  campus infrastructure and programmes. Also,  visitor can view the interior for  one of the signature places of FIST  building which is  Smart  Lab.  This level of accessibility is  consistent  with  the  findings  of Abidin  and  Suryani  [1],  who emphasized  the  effectiveness  of  360-degree  virtual  tours  in historical  learning and cultural comprehension. Similarly,  the virtual tour’s  comprehensive interior  views build a  stronger connection with the  campus’s  physical  places.  Furthermore,  the  techniques  are  consistent  with  recent  studies  demonstrating  the educational potential of immersive virtual environments in higher education [10, 13, 22]. Although the existing literature extensively explores virtual tours in a variety of contexts, including museums, cultural heritage, and urban contexts [1, 11, 12, 23], there is still a marked research gap in the area of university campuses. In particular,  the  current  literature lacks  in-depth  exploration  of campus-specific  virtual  tours  developed on  gaming platforms like Minecraft.  Although the  potential of  rich  and interactive  virtual  tours  has  been  acknowledged,  little attention has been paid to their application in the higher education sector. There is a notable gap in understanding the educational  value  of  university-specific  virtual  tours  and  how  they  can  provide  an  informative  and  enriching experience for students. In addition, although studies cite the impact of virtual tours on user engagement and decision-making,  gaps  remain  in understanding  how such  tours tailored  to  the university  campus and  influencing  business decisions [24, 25]. It is yet relatively unknown how to incorporate gaming mechanics and dynamics into these virtual tours and  there  is  a  knowledge vacuum about  how  these  components can improve engagement  and  memorability. Finally,  research  into  the  uptake  and  acceptance of  game-based  virtual  tours in  higher  education,  particularly  in university recruitment efforts is lacking in the literature. Therefore, this study seeks to fill these research gaps in order to fill the knowledge gap that exists in the field of virtual tours, particularly in the context of university campuses and student participation.  Based on these findings, several studies illustrate the potential of virtual campus tours as effective low-cost marketing tools that increase engagement, attract potential stakeholders and aid in university recruitment efforts. Notably, Osman El-Said  and  Heba  Aziz’s  [10]  study  emphasizes  the  impact  of  virtual tours  in  stimulating tourism recovery  post -COVID-19  by  demonstrating  their  ability  to  engage  and  attract  people.  Moreover,  Suwarno  and  Nerru  Pranuta Murnaka’s [16] study  on  student  views  of  university  virtual settings emphasizes the importance  of  virtual  campus tours in increasing engagement and delivering immersive experiences. In addition, Supraja et al. [5] demonstrate the successful  use  of  gamified  virtual  environments  to  engage  and  assist  students  during  the  COVID-19  pandemic, highlighting  the  potential  of such  tools  to  attract and  support  new  students.  Also, the  research  on smart  campus development  [13,  15] and  the  integration  of  Internet  of Things  (IoT)  technology  [14]  demonstrate the  favourable influence  of  technological  advancements on campus  engagement  and  efficiency, implying  that  similar  methods to virtual tours have a broader relevance. Furthermore, research on  the  usage  of  video  game  engines  to  create virtual tours  [9]  and interactive  campus  visit experiences  [21]  suggest that  such  tools can  effectively engage  and  attract visitors and potential students. While not  all references specifically address  the use of  virtual campus tours as low-cost marketing tools, the collective findings from these  studies  support  the  premise  that  immersive  and  interactive virtual experiences can effectively engage, attract and ultimately contribute to university recruitment efforts.  VII. CONCLUSION  This research has achieved  the goal of developing a campus  model  in Minecraft and creating an  interactive virtual tour of a university campus. Using a customized Minecraft clone, a virtual tour has been created with an engaging and immersive user experience that precisely replicates the campus architecture and allows for seamless exploration. The \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  39  integration of building information provided valuable insight into each structure and enhanced the informative nature of the virtual tour. User feedback and ratings confirmed the effectiveness and usability, engagement and accessibility while highlighting the potential of  gamified  environments  and virtual tours in education.  Overall,  this research has created a valuable resource for prospective students, educators and visitors and has revolutionized the way education campuses are experienced and presented. There exist some limits that should be addressed in this paper. For starters, the development of real-time interactions and dynamic events within the Minecraft clone was not viable due to time constraints and technical challenges. Due to this, the research was unable to simulate a more realistic and dynamic campus environment. Second, despite efforts to assure accuracy, the Minecraft reproduction of the campus may have found difficulties in duplicating every detail of the buildings and their environments. This could have results in small inaccuracies or discrepancies in the virtual tour. Furthermore, the project’s scope was constrained to a single campus, limiting its applicability to other educational institutions.  Finally,  the  project’s  evaluation  was  mostly  based  on  visitor  feedback  and  testing,  which  may  not represent all possible consumers’ opinions. Despite these limitations, the research serves as a solid platform for future improvements and a great starting point for further advances in campus modelling and virtual tours. There  are  various  potential  future enhancements  that  can  be  implemented  in  this project  to  improve  the  campus modelling in Minecraft. Integration of online multiplayer features, which would allow users to cooperate and explore the virtual campus together, is one path for improvement. This would build a sense of community and allow students, staff and prospective visitors to interact in a virtual environment. Another area for enhancement is the introduction of dynamic  components  within  the  Minecraft  clone,  such  as  real-time  events  and  interactive  activities.  These enhancements  would  increase  visitor  engagement  and  provide  a  more  immersive  and  realistic  experience. Additionally, broadening  the project’s  scope  to  include  other  campuses  or  educational institutions  will  broaden  its reach and influence. By  developing  a flexible framework or template  that  can be easily customised and adapted to weird  situations.  Other  institutions  will  be  able to  adopt  and profit  from the  smart campus  concept. These  future additions would elevate the virtual  tour’s  educational  value  and visitor experience, making it even more  beneficial and effective in the context of campus exploration and interaction. Moving  in  advance,  the  virtual  campus  tour  in  Minecraft  reveals  a  number  of  potential  research  possibilities. Addressing  technical  constraints  with  better  graphics  techniques  and  optimized  efficiency  is  still  a  top  concern. Scalability  to  include  many  campuses  while  allowing  for  customization  necessitates  modular  system  designs. Gamification, augmented/virtual reality and personalized learning experiences can all improve user engagement and knowledge retention. Exploring joint exploration and social interaction aspects could encourage people to share their experiences.  Additionally,  integrating  the virtual  tour with  campus  management systems  improves  administrative efficiency. These future directions promise an enhanced, immersive and personalized virtual tour, taking educational technology to new heights. While the virtual campus tour in Minecraft provided in this study is a unique and interesting way to explore university campuses,  its  limitation  necessitate  caution  in  interpreting  the  findings.  The  project’s  scope  may  obstruct  a comprehensive picture of campus life, potentially limiting its usefulness in communicating the full range of academic and extracurricular opportunities. Furthermore, the study’s demographic uniqueness and dependence on self-reported feedback  cast  doubt  on  the  study’s  good  findings’  generalizability.  Also,  the  distinctive  characteristics  of  each institution,  as  well  as  cultural  diversity  among  potential  students,  may  affect  the  tour’s  efficacy  in  diverse circumstances. Recognising these limitations highlights the importance of additional study to produce more inclusive and adaptive virtual campus tour solutions.  REFERENCES  [1] R. Abidin & N. Suryani, “Students' Perceptions of 360 Degree Virtual Tour-Based Historical Learning About the Cultural Heritage Area of the Kapitan and Al-Munawar Villages in Palembang City”, International Journal of Social Sciences and Management, vol. 7, no. 3, pp. 105-112, 2020. [2] Anshary, M. A. K., Ramdani, C. M. S., Dewi, E. N. F., Rahman, A. N., & Syahriszani, R., “Application of Point Tracking Technology in 360 Degree Panorama Virtual Tour Applications for Introduction to Siliwangi University Campus”, CESS (Journal of Computer Engineering, System and Science), vol. 8, no. 1, pp. 12-21, 2023. [3] M.  A. K. Anshary, C. M.  S. Ramdani,  E. N.  F. Dewi, A. N. Rahman & R.  Syahriszani, “Application of Point Tracking Technology in 360 Degree Panorama Virtual Tour Applications for Introduction to Siliwangi University Campus”, CESS (Journal of Computer Engineering, System and Science), vol. 8, no. 1, pp. 12-21, 2023. \nJournal of Informatics and Web Engineering              Vol. 3 No. 1 (February 2024)  40  [4]  J.  Radianti,  T.  A. Majchrzak, J. Fromm  &  I.  Wohlgenannt,  “A  Systematic  Review  of  Immersive  Virtual Reality  Applications for  Higher  Education: Design Elements, Lessons Learned, And Research Agenda”, Computers & Education, vol. 147, 103778, 2020. [5] S. Supraja, S. Tan, F. S. Lim, B. K. Ng, S. Y. Ho & A. W. H. Khong, “Freshmen Orientation Program Using Minecraft: Designed by Students for Students during the COVID-19 Pandemic”, IEEE Frontiers in Education Conference (FIE), pp. 1-9, 2022. [6] M. Chang, G. B. Lee, J. H. Lee, M. Lee, & J. H. Lee, “The Influence of Virtual Tour on Urban Visitor Using a Network Approach”, Advanced Engineering Informatics, vol. 56, 102025, 2023. [7] R. Tse, S. Mirri, S.-K. Tang, G. Pau & P. Salomoni, “Modelling and Visualizing People Flow in Smart Buildings: A Case Study in a University Campus”, Proceedings of the Conference on Information Technology for Social Good (GoodIT’21), pp. 309-312, 2021.  [8] A. Latifah, S. H. Supangkat & A. Ramelan, “Smart Building: A Literature Review”, International Conference on ICT for Smart Society (ICISS), pp. 1-6, 2020. [9] C. Meier, J. L. Saorin, A. B. d. Leon, A. G. Cobos, “Using the Roblox Video Game Engine for Creating Virtual Tours and Learning About the Sculptural Heritage”, International Journal of Emerging Technologies (iJET), vol. 15, no. 20, pp. 268-280, 2020. [10] O. El-Said and H. Aziz, “Virtual Tours a Means to an End: An Analysis of Virtual Tours’ Role in Tourism Recovery Post COVID-19”, Journal of Travel Research, vol. 61, no. 3, pp. 528-548, 2022. [11] R. L. A. Castillo & X. D. L. Zegarra, “The Tours in Virtual Museums a Didactic Opportunity in Social Sciences”,  International Conference on Virtual Campus (JICV), pp. 1-4, 2020. [12]  M.  D.  Fino, C.  Ceppi,  &  F.  Fatiguso, “Virtual Tours and  Informational Models  for  Improving  Territorial  Attractiveness and  The  Smart Management of Architectural Heritage: The 3D-Impact Project”, The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, vol. 44, pp. 473-480, 2020. [13] Y. Huang, S. Ali, X. Bi, X. Zhai, R. Liu, F. Guo & P. Yu, “Research on Smart Campus Based on the Internet of Things and Virtual Reality”, International Journal of Smart Home, vol. 10, no. 12, pp. 213-220, 2016. [14] T. Sutjarittham, H. H. Gharakheili, S. S. Kanhere & V. Sivaranam, “Experiences with IoT and AI in a Smart Campus for Optimizing Classroom Usage”, IEEE Internet of Things Journal, vol.6, no.5, pp. 7595-7607, 2019. [15] M. W. Sari, P. W. Ciptadi & R. H. Hardyanto, “Study of Smart Campus Development Using Internet of Things Technology”, IOP Conference Series: Materials Science and Engineering, vol.190, 012032, 2017. [16]   Suwarno &  N.  P. Murnaka,  “Virtual Campus Tour  (Student Perception  of University Virtual Environment”, Journal of  Critical Reviews, vol.7, no.19, pp. 4964-4969, 2020. [17] M. Muhhin, D.  Nael, R.  -H. Tunnel  & U.  Norbisrath, “Adventure and  Quiz  Learning Game Based  On a  Virtual Tour of  a Video  Game Museum”, International Journal of Software Engineering & Applications, vol. 14, no. 1, pp. 23-37, 2023.  [18] W. H. Tan, “Student-led Gamification in the Undergraduate Design History Course”, International Journal of Creative Multimedia, vol. 1, no. 2, pp. 1–17, 2020.  [19] F. J. Agbo, S. S. Oyelere, J. Suhonen & M. Tukiainen, “Design, Development, and Evaluation of a Virtual Reality Game-Based Application to Support Computational Thinking”, Educational Technology Research and Development, vol. 71, no. 2, pp. 505-537, 2023. [20] A. Nolan, E. Nolan, R. Nolan & F. Nolan, “Modelling a Meta Smart City on Mars in Minecraft”, World Automation Congress (WAC), pp. 222-227, 2021. [21] M. B. Garcia, D. M. C. Mansul, E. B. Pempina, M. R. L. Perez & R. T. Adao, “A Playable 3D Virtual Tour for an Interactive Campus Visit Experience: Showcasing School  Facilities to Attract Potential Enrollees”,  9th International Conference on Virtual  Reality (ICVR),  pp. 461-466, 2023. [22] G.  Mak   & L.  Zhao, “A  Systematic Review:  The Application of Virtual Reality on The Skill-Specific  Performance in  People With ASD”, Interactive Learning Environments, vol. 31, no. 2, pp. 804-817, 2023. [23] M. A. M. bin Saedon, “Tourists’ Perception on Virtual Reality Application of Traditional Malay House”, International Journal of Creative Multimedia, vol. 3, no. 1, pp. 57–67, 2022.  [24] H. N. Yuwono, W. R. Fitriani, A. N. Hidayanto & S. A. Kurnia, “Response to the Educational Roadblock due to the Pandemic: How Can a University Virtual Tour Experience Affect Enrolment Intentions?”, International Journal of Innovation and Learning, vol. 34, no. 3, pp. 290-312, 2023. [25] A. Pal, A. Tiwari, A.Singh, M. Tanganiya, R. Bhat & V. B. Lobo, “A Tour of a Technical and Educational Campus Using Virtual Reality”, In 2023 3rd International Conference on Pervasive Computing and Social Networking (ICPCSN), pp. 1578-1583, 2023.   "
    },
    {
        "name": "Therapeutically applied Minecraft groups with neurodivergent youth",
        "url": "https://www.researchgate.net/publication/375790998_Therapeutically_applied_Minecraft_groups_with_neurodivergent_youth?_sg=krdlQRZx3swU0EAxBnaIEzXWHhxZbD_ZV0Xwbq0GYqXOekBvMpD9QMOplFXfV48czEkcsXjmahv-X5o",
        "text": "METHOD ARTICLE Therapeutically applied Minecraft groups with neurodivergent youth [version 2; peer review: 1 approved, 1 approved with reservations]Elizabeth Kilmer 1,2, Johnny Spangler2,3, Jared Kilmer 21Take This, Seattle, WA, USA 2Game to Grow, Seattle, Washington, 98125, USA 3Antioch University, Seattle, WA, 98121, USA First published: 27 Feb 2023, 12:216  https://doi.org/10.12688/f1000research.129090.1Latest published: 20 Nov 2023, 12:216  https://doi.org/10.12688/f1000research.129090.2v2 Abstract BackgroundTherapeutically applied Minecraft groups are an intervention designed to support social engagement, confidence, and competence in youth. The flexible interaction format and use of a popular digital game support the fit of this intervention for use with neurodivergent youth. Minecraft is leveraged to support opportunities to build authentic relationships and social confidence in an engaging, low-stakes environment with peers. The group format allows for real-world social practice with peers, while the game environment can support motivation to interact with others, and provides multiple modes for such interaction (i.e., chat, building/movement with the avatar).MethodsThis article outlines the theoretical foundations of therapeutically applied Minecraft groups as well as practical considerations for implementation. The method outlined includes the justification for this method, process of creating support groups, check-in and check-out processes, and in-game activity examples for different situations.Use CasesUse cases are included to illustrate how the methods have been used in the past to support social growth with neurodivergent youth. Use Open Peer ReviewApproval Status    1 2version 2(revision)20 Nov 2023version 127 Feb 2023 view viewJames Hutson, Lindenwood University, Saint Charles, USA1. Siva Priya Santhanam, Bowling Green State University, Bowling Green, USA2. Any reports and responses or comments on the article can be found at the end of the article.Page 1 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nCorresponding author: Elizabeth Kilmer (elizabeth.d.kilmer@gmail.com)Author roles: Kilmer E: Conceptualization, Methodology, Project Administration, Validation, Visualization, Writing – Original Draft Preparation, Writing – Review & Editing; Spangler J: Conceptualization, Methodology, Supervision, Validation, Visualization, Writing – Original Draft Preparation; Kilmer J: Methodology, Writing – Original Draft Preparation, Writing – Review & EditingCompeting interests: At the time of writing, all three authors were employed by Game to Grow, a nonprofit organization that uses Therapeutically Applied Minecraft groups with participants and provides training on the use of the groups. Neither Elizabeth Kilmer nor Jared Kilmer are still employed by this organization.Grant information: The author(s) declared that no grants were involved in supporting this work.Copyright: © 2023 Kilmer E et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.How to cite this article: Kilmer E, Spangler J and Kilmer J. Therapeutically applied Minecraft groups with neurodivergent youth [version 2; peer review: 1 approved, 1 approved with reservations] F1000Research 2023, 12:216 https://doi.org/10.12688/f1000research.129090.2First published: 27 Feb 2023, 12:216 https://doi.org/10.12688/f1000research.129090.1 cases include examples of different Minecraft servers, such as the habitat, and identifying stresses of social growth such as school anxiety and how the use of therapeutically applied Minecraft helped.ConclusionsTherapeutically applied Minecraft groups can provide opportunities for peer connection and social practice in a facilitated environment. Though the use of Minecraft and other games to support learning and social connection is prevalent in the media, the academic research in this area is sparse. This article provides an example of Minecraft in use in a therapeutic context and calls for more formal research in this area of therapeutically applied games.Keywords Minecraft, digital games, therapeutically applied minecraft, autism, ADHD, applied games, social skills This article is included in the Diversity, Inclusion and Equity in Game Development and Design collection.Page 2 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nIntroductionTherapeutically applied Minecraft groups are an intervention designed to support social engagement, confidence, andcompetence youth and are particularly well-suited for use with neurodivergent youth, such as those with diagnoses ofautism and/or ADHD. This group-based intervention utilizes the popular digital game Minecraft to create opportunitiesfor building social capacity and confidence in an engaging, low-stakes environment with peers. The group format allowsfor real-world social practice with peers. The use of the game environment can support motivation to interact with others,especially for participants who are fearful or disinterested in peer interaction. Finally, the use of a digital game providesmultiple modes for such interaction (i.e., chat, building/movement with the avatar), which creates greater autonomy incommunication for the participants than a traditional in-person or virtual social skills group.The reciprocal relationship between social connection and physical and mental wellness is well-documented (Orbenet al., 2020;Viner et al., 2012). Neurodivergent individuals, such as autistic individuals and those with attention-deficit/hyperactivity disorder (ADHD) are more likely than their neurotypical peers to experience peer rejection, loneliness, andsocial isolation (Heiman et al., 2015;Shea and Wiener, 2003;Unnever and Cornell, 2003;Orsmond et al., 2013).In both ADHD and autistic individuals, loneliness has been found to increase the likelihood of depressive symptoms(Hedley et al., 2018;Houghton et al., 2020). Challenges with social isolation became even more pronounced during theCOVID-19 pandemic, though peer support was found to be a protective factor (Laslo-Roth et al., 2022;Sibley et al.,2021;Pellicano et al., 2022).Challenges with communication and relationship building, especially in relation to neurotypical norms are intrinsic to thediagnostic criteria of both ADHD and autism spectrum disorder (APA, 2022). Notably, though diagnostic and treatmentnorms have historically been focused on aligning individuals with neurotypical standards for social communication,newer interactionist/ecological neurodiversity approaches emphasize a shift in societal and environmental norms, whilealso supporting the development of skills adaptive to an individual’s current environment (Dwyer, 2022). Consistent withthese approaches and as challenges with peer communication can contribute to peer rejection and isolation, supportingneurodivergent adolescents’social competence and confidence may be a valuable tool to reduce isolation and increasepeer connection. Therapeutically applied Minecraft can provide opportunities for peer connection and social practice in afacilitated environment. Though the use of Minecraft and other games to support learning and social connection isprevalent in the media, the academic research in this area is sparse. This article is intended to outline the rationale fortherapeutically applied Minecraft groups, share current use cases of the intervention, and highlight the need for furtherresearch in this area.Minecraft is a first-person, sandbox-style, video game first developed by Mojang Studios in 2011 and purchased byMicrosoft in 2014. Since its launch, Minecraft has expanded into a growing franchise that has enjoyed world-widesuccess, currently holding the title for best-selling videogame of all time (Microsoft, 2021). Indeed, over 50% of youth(ages 9-11) in North America and Europe play Minecraft (Microsoft, 2021). This widespread popularity makesinterventions utilizing Minecraft especially well-suited for building social capacity that leverages shared interests andhobbies. In Minecraft, players have a customizable avatar they use to explore and interact with the procedurally generatedworld around them. Different modes (i.e., Survival and Creative) within the game allow for a customized user experience,providing players agency to adjust the amount of combat, challenge level to obtain materials, and ability to shape theworld to fit their preferred playstyle. When used as a therapeutic intervention, the facilitator is empowered to adjust theenvironment and rules of the game to support player engagement and growth.At its core, Minecraft is a building and exploration game, with mechanics that encourage creativity and nonlinearengagement. Minecraft has two primary styles of play, known as game modes, each emphasizing different aspects ofplayer interaction within the virtual world. In Survival mode, players must find and gather resources in order to managethe health and hunger needs of their avatar, build structures, defend against hostile creatures, and navigate varioushazardous locations. The challenges inherent in Survival are focused on player progression and resource gathering. Forexample, a new player must first make a wood pickaxe in order to gather stone, which in turn allows them to create a stoneREVISED Amendments from Version 1This version has been updated to address suggestions made by a reviewer to improve clarity and structure of the article.In specific, more information regarding the purpose of the article and Minecraft applications have been added, and some ofthe content of the article has been reorganized for clarity. Further, more clarification around the goals of the groups andnecessary qualifications for facilitators has been added.Any further responses from the reviewers can be found at the end of the articlePage 3 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\npickaxe, allowing them to mine iron. These resources must be found through exploration within the game world. Incontrast, Creative mode resembles a complex digital LEGO set. Players have unlimited access to any resources in thegame, they can fly around the world, place and break blocks easily, and the health and hunger mechanics are turned off.Creative mode incentivises building and creativity. Players can create fully interactive constructs without committingtime to resource gathering including houses, spaceships, pixel art, or even recreate Middle Earth from The Lord of theRings (https://www.mcmiddleearth.com/). While each game mode highlights particular styles of play, there is no clearrestriction between play style and game mode. Many popular Minecraft players on YouTube have become famous forexpressing their creativity and building skill while playing in Survival mode (i.e., Technoblade, Dream, Mumbo Jumbo).The need for neurodivergent affirming social groupsWith the appropriate support from qualified facilitators, Minecraft may be particularly well-suited to support the socialcapacity of neurodivergent youth. Neurodivergent individuals, such as those with ADHD or who are autistic, oftenface significant social stigma and rejection that can be detrimental to their mental health and well-being (Baumingeret al., 2003;Hedley et al., 2018;Mueller et al., 2012). Challenges with social communication and relationships, oftenassociated with and exacerbated by the stigma of deviating from neurotypical standards of communication, can lead tofeelings of rejection and isolation for autistic individuals (Milton, 2012). Additionally, autistic and ADHD individuals aremore likely to experience bullying and peer rejection than their neurotypical peers (Paulson et al., 2005;Maïano et al.,2016).In order to avoid social rejection and fit in among their neurotypical peers, many neurodivergent individuals intentionallycamouflage or ‘mask’their symptoms and behaviours (such as stimming, echolalia, and interrupting behaviour) to appearmore neurotypical or “normative”(Cook et al., 2018;Dean et al., 2017;Hull et al., 2021;Pearson and Rose, 2021).Further, many traditional social skills training programs reinforce such masking through the notion that to be successfulin community, educational, and employment settings individuals must ‘fit in’and display neurotypical communicationbehaviours such as direct eye contact while speaking with others. However, despite the theoretical underpinnings oftraditional social skills training programs, many autistic individuals have reported negative mental health outcomesrelated to this type of program and messaging, such as feeling disconnected from their sense of identity (Shkedy et al.,2020;Miller et al., 2021). Additionally, though traditional social skill training programs have been widely popular, therehave been recent criticisms. One criticism is that these programs can increase the knowledge of ‘social skills’forneurodivergent youth, but they don’t self-reported or teacher-observed use of such skills (Gates et al., 2017).As neurodivergent youth benefit from increased social networks and social support, identifying ways to support theirsocial growth in a way that is affirming, engaging, and leads to real social connections is vital. Utilizing activities such asdigital games that youth already find enjoyable and offer opportunities for social connection can create an excellentplatform from which to scaffold social capacity. In this context, scaffolding refers to facilitator support through in-gameenvironmental changes, intentionally designed activities, or interpersonal facilitation between platers in the group,participants may be able to engage in more challenging or complex social encounters than they would be able to do ontheir own. Some research has found that Minecraft may be more aligned with some neurodivergent individuals' naturalcommunication styles as it allows for modes of communication aside from face-to-face interaction (Ringland et al.,2016). Additionally, with the continued prevalence of Minecraft as a hobby for youth, coupled with many adolescents’active participation within at least one community server providing opportunities for social play, interventions usingMinecraft can leverage pre-existing enthusiasm and social resources to enhance intervention outcomes. As socializationand connection between peers becomes commonplace in virtual settings, therapeutically applied Minecraft groups cancreate a naturalistic social setting to practice immediately relevant and meaningful social skills. Some of the aforemen-tioned criticisms of traditional social skills groups can be addressed by shifting the context in which social skills practiceoccurs to a more real-world setting (Gates et al., 2017). Further, shared backgrounds and interests can be a catalyst formotivating inter-group relationships and pro-social behaviour towards peers (Daniel and Billingsley 2010;Grandin,2019). For example, participants are able to build on a shared knowledge set (i.e., their interest and expertise in the game)while building rapport amongst each other.Additionally, in the authors’anecdotal experience, many neurodivergent adolescents report developing avoidancebehaviours associated with social interactions, often stemming from multiple prior negative experiences with peers.Substantiating this, it has been proposed that social confusion and peer rejection related to autism presentation mayincrease social anxiety and social avoidance in autistic individuals (Wood & Gadow, 2010), and qualitative research withmale autistic adolescents support that previous rejection and fear of future rejection can lead to avoidance behaviors(Acker et al., 2018). Perceived asociality in neurodivergent individuals, especially autistic individuals, may be morerepresentative of learned behaviour than an inherent lack of desire to connect with others. Interventions that set up peernetworks for autistic students have been found to increase social engagement among their participants (Hochman et al.,2015). However, simply creating a facilitated social space that respects individual communication needs may notPage 4 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\ninherently increase an individual's willingness to communicate with others, especially for individuals with high levels ofsocial anxiety (Acker et al., 2018). Using a valued activity (e.g., Minecraft) can create both an added layer of safetystemming from the familiar environment, as well as an increased willingness to communicate with others in order tocomplete shared goals such as building a fortress or defeating a dragon.Further, participation in social activities through a virtual environment creates opportunities to try new skills withpotentially lower consequences for failure than a real-life setting, which may be particularly helpful for neurodivergentparticipants with a history of peer-rejection.Justification for Minecraft as a platform for therapeutic interventionAlthough a number of video games and other platforms can provide a virtual space for individuals to interact, the authorsof this article posit that Minecraft is a particularly auspicious choice for therapeutic application due to several keycomponents. Minecraft has precedent of use in educational and therapeutic contexts, is a popular multiplayer game withmultiple game modes, and contains seemingly limitless opportunities for customizing the in-game experience.The first-person, sandbox-style of Minecraft has been utilized in educational and therapeutic contexts alike. Interventionsusing Minecraft have previously been designed to support cooperative communication among autistic youth (MacCor-mack and Freeman, 2019). MacCormick and Freeman’s‘virtual environment social program’is a heavily structuredintervention that utilizes the framework of Legoff’s LEGO therapy in the Minecraft virtual setting to support strategiccommunication with autistic youth (LeGoff, 2004;LeGoff et al., 2012). Similar to LEGO therapy, participants take turnsin specific roles (i.e., architect, artist, and foreman) to create buildings (MacCormack and Freeman, 2019). Togetherparticipants choose a structure to build in the game, and then work together within their predefined roles to make thebuilding. In addition to autism specific groups, Minecraft has been utilized in community building programs, such as the‘Minecraft Gaming Day’developed by a library in Melbourne (Cilauro, 2015). Minecraft has been further utilized tosupport the development of conflict-resolution skills (Jagannath et al., 2020), social learning, and emotional regulationskills in adolecents (Zolyomi & Schmalz, 2017). Minecraft’s‘Education Edition’has supported the expansion ofMinecraft to support social-emotional and academic curricula in schools (Baek et al., 2020;Cheng, 2016). In additionto group-based interventions, Minecraft has also been utilized in the context of individual therapy (Finch, 2021).Perhaps a key component in supporting such educational and therapeutic uses, Minecraft is popular. In North Americaand Europe, over 50 percent of kids ages 9-11 play Minecraft and it has over 140 million active monthly users (Microsoft,2021). When identifying a game to utilize within a therapy setting, using a game that participants are likely to be familiarwith, can increase participant motivation and willingness to engage, as well as create opportunities for the participant to bean expert in the area. Minecraft may be an especially good fit when working with neurodivergent individuals, as there aremultiple Minecraft servers and communities specifically designed for neurodivergent individuals such as Autcraft(https://www.autcraft.com/), designed for youth with Autism.In addition to its current popularity, Minecraft has demonstrated longevity within the zeitgeist - the game has beenreleased for over a decade and continues to maintain popularity within adolescent demographics. With the learning curveand effort involved in implementing game-based therapeutic interventions, the game used should have some expectationof longevity. Additionally, the prevalence of Minecraft in the culture creates a natural bridge between skills learned withinthe therapeutic setting and other experiences. One example of this generalization can be seen in an anecdote one of theauthors using vocabulary from Minecraft to connect with their student. A student was having a difficult time expressingtheir emotions as they were getting more frustrated in a social situation. The teacher asked, “are you feeling Creeper levelfrustrated, or are you more of a Zombie right now?”The student thought about it and answered “Actually, I am AngryPigman angry; I am ok but if someone touches me I am going to attack them.”The cultural ubiquitousness of Minecraftknowledge not only gave this student a shared language to express how they were feeling, but it also encouraged them toreflect on the type of frustration they were feeling and express how it presented externally.Minecraft has multiple game modes, a multitude of community-designed customization options, and no clearly definednarrative or in-game goals. As such, it can be used as an open-world play-space for therapeutic applications, similar to awell-stocked play therapy room or the stand tray in sand tray therapy. The facilitator can customize the world to createguides and boundaries as appropriate to support participation in group activities. For example, the group could start in astandard generated world and work together to build a secret hideout. For groups that benefit from a more visual buildingprompt or guidelines, the facilitator could build a series of floating islands over an ocean and invite each player tocustomize their own island. The second option creates visual boundaries that may support players staying in the same areaon the map, increasing opportunities for collaboration.Page 5 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nIn contrast to a physical play space, facilitators have increased control over the environment of the Minecraft game space.For example, if a participant becomes frustrated and uses their avatar to damage the in-game constructions of anotherplayer, the participant or facilitator can typically fix the damage to the construction with minimal effort. In contrast, therepair of such damage may not be possible to the same extent in the real world due to limited resources (i.e., time, money,material). The use of games or simulation to practice skills in contained environments is common practice in educationand medical fields, and skills practiced in such simulated environments, especially when the simulation is responsive toplayer input, have been found to translate to real-world use and competency (Sturm et al., 2008;Ward et al., 2006).As of this writing, Minecraft has three editions - Java, Bedrock, and Education. Java Edition is the most customizable ofthe three, with immense community support through mods, plug-ins and tutorials. Java is only available on PC andrequires a significant amount of computer processing power. While Java offers greater access to group management andplayer safety features (such as being able to undo player actions), this edition requires the use of mods and plug-ins tooptimally function. This results in a higher set-up time cost and level of technical knowledge by the facilitator. In contrast,Education Edition was designed for use in schools, and designed to be implemented by educators with little priorknowledge of Minecraft for use in classrooms and after school clubs. Minecraft Education Edition has premade activitiesand more safety features innately enabled, but fewer opportunities for customization by the facilitator and players.Though Education Edition can be an excellent option for many facilitators newer to Minecraft or with less time to invest inlearning technical skills, some experienced players may be frustrated by the lack of customizability. Finally, BedrockEdition is designed to be playable across a multitude of devices, including PC, gaming systems, mobile devices, and evenVR. The drawback to Bedrock is that it has the least amount of customizability of the three. The therapeutically appliedMinecraft groups outlined in this article utilize the Java edition.MethodsTherapeutically applied Minecraft groups can be delivered virtually or in-person. When delivered virtually, participantsshould be in a private, shared voice and video chat to supplement the in-game opportunities for communication (e.g.,chat). Among in-person groups, the ideal setup allows participants to see and hear each other with minimal effort - forexample, participants can play on laptops around a shared table. Each session, group members meet to collaborate onshared goals that require communication, regulation, and planning skills. Goals for each group will vary based on theneeds and preferences of the members, and generally fall under the umbrella of social confidence and social capacitybuilding. Groups consist of three to five participants and one facilitator. Participants typically meet for 90-minute weeklysessions for nine-12 weeks. Re-enrolment in groups can be appropriate when it supports participant goals, such as todeepen and maintain friendships. The structure of every group includes a check-in (10 minutes), in-game activities(75 minutes), and a check-out (five minutes).Facilitators of therapeutically applied Minecraft groups should have training and experience with the needs andexperiences of the group members, facilitating group-based interventions, and managing a Minecraft server. Thoughspecific degrees or licensure are not required in many areas for therapeutic (as opposed to psychotherapy) services,facilitators should seek appropriate training and/or supervision if operating on the edge of or outside their area ofcompetency. Specific requirements for training and education of facilitators delivering therapeutic or psychotherapyservices vary by state, and facilitators should adhere to any requirements in the area in which they practice. The facilitatorof the therapeutic Minecraft groups explored in the use cases in this article is a licensed mental health counselor in the stateof Washington, with extensive experience working with neurodivergent youth in group-based settings.Each participant must have their own device that runs Minecraft in order to participate in the group activities. Whetherparticipants are meeting in person or virtually, they play together by connecting to a Minecraft server which runs theshared world they will be playing in. Servers are a separate computer that players connect to through a local network orover the internet. Though it is possible to join someone else's personal world without the use of a server, which is oftenhow Minecraft is used in one-on-one therapeutic settings, when running a group session it is necessary to have a centralcomputer that hosts a shared world. This gives the facilitator more control over the experience of the participants and is themost stable option when it comes to connecting multiple participants in a single Minecraft world.Check-inDuring the group check-in, participants answer a check-in or warm-up question to support their orientation to the groupand create an opportunity to learn more about the other participants through a structured prompt. Though the questionchanges each session, the consistent routine of the check-in can create structure that supports the ambiguity of thechanging question. This routine can be particularly beneficial to neurodivergent individuals as the changing check-inquestion is embedded in a known routine. The check-in process typically takes approximately five minutes and marks theformal start of the group. While participants are answering the check-in question, their game avatars can be in thePage 6 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nMinecraft server, and should be in a minimally engaging environment. Participants may be eager to join the game andstart playing, so having a consistent ‘waiting room’space inside the in-game environment allows participants to be in thegame as the group starts (e.g., a small floating island in outer space). An example of a waiting room can be seen inFigure 1. The consistent waiting room space can create an engaging enough environment for participants to stay in thespace during check-in but should not be so engaging as to distract from the check-in process. When working withneurodivergent adolescents in-particular, the authors have found that ‘blank room’waiting spaces can lead to participantsleaving the shared server and logging into a personal Minecraft server, however the ‘waiting room’often has enoughvisual stimuli that when coupled with the predictable routine of check-in to in-game activities can support playerengagement.In-game activity examplesFollowing the check-in, the group moves to the in-game activities. Depending on the interests and needs of the group,participants may engage in one activity for an entire session, or switch between two activities. Additionally, it is commonfor groups to have ongoing goals they can return to across sessions. These goals often are related to larger building orstrategy projects. There are a multitude of in-game activities that can be used to support group cohesion and playergrowth, with varying levels of preparation and facilitator technical skill required. The authors have highlighted threecommonly used activities in therapeutically applied Minecraft groups.Maze swap - creative mode activityCreative mode allows for low-stakes opportunities for collaboration and creativity, without the stress of resourcemanagement or time pressures. An activity that uses the Creative game mode is ‘Maze Swap’. In this activity, the groupis broken into two teams. Each team is tasked with building a maze that another team will attempt to complete. They aregiven a time limit and the prompt that the maze needs to be ‘fun, challenging, and engaging’. After the building time haselapsed, the teams swap locations and attempt to complete the other team’s maze. This activity focuses primarily on theskills of group collaboration, communication, and perspective taking. While each participant can take their own section ofthe maze to work on or work together on each section, they still need to coordinate with their peers to make sure thatareas connect and that there is an overarching structure to the build, with a clear beginning and end. The structure of thisactivity allows participants to choose their level of peer interaction. This allows players to fully participate in the activityregardless of their level of social comfort and increase their interaction with peers as they become more interestedand comfortable. Within this activity, the participants are encouraged to be creative and add their own style to the build,giving them a sense of ownership with the final product. The autonomy participants’have in the design and buildingprocess can support participant investment in the activity and feedback process. Throughout the activity, facilitatorscan prompt questions and conversations about the intent and expected impact of design choices, creating opportunities forFigure 1. Example of a Minecraft waiting room.Page 7 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nparticipants to engage in perspective taking about the other team’s experience. Participants are encouraged to putthemselves in the shoes of the players who will be going through their maze. They are asked questions like ‘Is any part toohard or frustrating?’or ‘How clear are the goals of the maze?’. After the teams go through each other’s mazes, they arebrought back together to debrief the experiences and offer feedback on what was ‘fun, challenging, and engaging’, givingthe teams the opportunity to understand how well each team’s intentions for their mazes aligned with the actual playexperience.Laser tag - minigame exampleMinigames are games created within Minecraft, using its mechanics to facilitate player experiences in a highly targetedway. These activities are typically set up in the game ahead of time by the facilitator, and players are transported to aspecific area within which to participate in the game. Minigame activities are commonly found on public Minecraftservers, and these activities can be adapted within private servers for therapeutic use. One example of a minigame is lasertag. In this game, participants are divided into two teams, given a bow, and placed in an enclosed arena with the goal ofhitting the other team with their arrows. Once hit, players are returned to ‘spawn’where they can re-enter the arena andcontinue playing. An in-game scoreboard keeps track of hits, and each team tries to earn the most points. Similar to teamsports, this activity can support frustration tolerance, planning, and strategic communication skills. This activity functionswell as an intermezzo between more focused activities or as a group rapport building activity. As laser tag and many otherminigames are competitive, facilitators should be mindful of participant’s skill with minigames, their frustrationtolerance, and response to failure. If participants find the game too challenging or overwhelming, participation in suchan activity may damage rapport instead of supporting its growth.Quest board - survival exampleSurvival mode is well-suited for activities that require planning, time management, and collaboration. Players have fewerabilities and limited resources than in creative mode, and survival mode requires ongoing character management of healthand hunger. An example of a Survival mode activity is ‘Quest Board’. In this activity, participants are given a new worldto explore. The basic mechanics of the game require them to start gathering materials and building shelters. Participantscan gather resources and build their shelters independently or collaborate with other group members, which maintainsoptions for participant autonomy. The facilitator creates a board in the game prior to the group start with specific questsand rewards. The quests are geared towards particular styles of engagement that are growing edges for the participants.Examples of tasks can be ‘find a flower that is the favourite colour of another player’or ‘build a house that has a room foreach player’. These tasks emphasize reciprocal communication and collaboration.Check-outThe check-out process allows for a consistent and predictable transition from the game space to the end of the group andthe real world. This routine transition can be particularly helpful for neurodivergent youth, who may struggle to switchtasks. During the check-out process, the participants and facilitator answer three questions in the same order. Unlike thecheck-in question, the check-out questions do not vary from week to week. The three questions are ‘What is a spotlightyou would like to shine on someone else? Something they did that enhanced your game today’,‘What was a challenge orsomething you learned?’, and ‘What is something you’re looking forward to for the next group?’. These questions allowparticipants to reflect on their play and draw connections between their experience and the other players. The facilitatorcan use their own response to highlight participant actions, model self-reflection, and reframe challenging scenarios.Use casesEthical statementThe following use cases share examples of participant experiences in Therapeutically applied Minecraft groups. Allparticipant names have been changed to protect their privacy, and other identifying information has been omitted.Participants discussed in these use cases were asked for permission to share their stories and written informed consent toshare the below stories was obtained from participants’legal guardians. Data from these groups was not formallycollected to be assessed for validated, but in some cases instances were noted to demonstrate the potential effectiveness ofthis method. The below use cases fall under Antioch University’s definition of ‘Individual Case Studies’, do not meetcriteria as human subjects research, and did not require IRB review.‘The habitat’A group consisting of five participants, ages 10-12 met online for weekly group sessions. The participants identified asneurodivergent and also reported a history of difficulty with peer communication and rapport building. Communicationwas facilitated through video chat and group activities happened within a shared Minecraft world. Four of the participantsPage 8 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nhad been meeting for several months, and a new participant was joining the group. The facilitator’s goals were to help thenew participant orient to the group norms while encouraging the other participants to incorporate new perspectives intotheir activities. To support a successful integration of the new participant to the group and allow the participants toincrease their communication at a rate comfortable to them, the facilitator selected an activity that began with parallelplay, with opportunities for increased communication and collaboration as the players were ready. Players were eachgiven an animal and were asked to create a ‘habitat in a box’for the animal within a specified amount of time. The timelimit, type of animal, and the scope of the habitat created clear guidelines for the players to then utilize their creativity todetermine what the best ‘habitat’was for their animal. While the participants were building, the facilitator encouraged theparticipants to talk through their build and creative thought process, keeping a focus on the goal of the activity whileallowing participants to take cues from each other. While the experienced participants engaged in the activity withouthesitation, Max1, the new participant, was not immediately interested in the activity and began flying around the world. Atone point Max began interacting with other habitats by filling them with animals, which upset the other participants.When it was pointed out to Max that his actions were making others upset, he was visibly upset and it was clear to thefacilitator that he had not expected his actions to have this reaction from others. The facilitator used a perspective takingintervention, asking Max if he was aware the habitat box belonged to someone. Max responded “I guess so, but I didn’tthink about it. It just looked so cool I wanted to use it, I’m really sorry I ruined it.”Max’s statement allowed the othergroup members to better understand Max’s intent and decision-making process. This, combined with the complimentabout how ‘cool’the box was, supported the repair and re-engagement process with the other group members. Thefacilitator then supported the players in reflecting on what it can feel like to be in a new group and not understand theexpectations yet. Participants were asked if they ever made a mistake and hurt someone’s feelings, and how that felt. Thefacilitator removed all the dogs, restoring the build to its original form, and Max then flew off to make his own ‘dog box’.This is a particularly poignant example of a facilitated social engagement because Max had had a history of being kickedout of social groups due to ‘bullying behaviour’. The flexibility of Minecraft, paired with strong facilitation skills,allowed him to experience rupture and repair within a social setting, while also providing perspective taking opportunitiesfor the other participants. While this experience could have happened in another social setting with a skilled facilitator,Minecraft offered both an easily accessible shared space for players to engage within, along with the lower stakes thatcomes from a virtual space that the facilitator has technical control over.School anxietyIn addition to supporting in-group communication, Minecraft can be used as a medium to create shared languageaccessible to younger participants. This group consisted of four participants who connected through video chat and ashared Minecraft world. In anticipation of the participants returning to school after summer vacation, the facilitator chosean activity designed to help the participants process their emotions around the coming change. The participants weregiven a pre-made model of a school within Minecraft. It consisted of hallways, lockers, classrooms, bathrooms, big frontdoors, and a principal's office. The participants were asked to pick a classroom and make it look like the one at theirschool. They were also given the option to work on the rest of the school once they were finished. Once the allotted timehad finished, the facilitator took the group around on a tour of the classrooms while each student described their designprocess for each classroom. One classroom had been filled with Minecraft villagers, who wander around and make noise.Through subtle guidance and prompting from the facilitator, the participant was able to describe how their classroom was“always really noisy”and that they often felt overwhelmed in the space. Other participants chimed in with similarexperiences and spontaneously started sharing ideas for how to help with the noise. The session ended with the groupworking together to cover the classroom with wool blocks (to reduce the noise) and corralling all the villagers out into thehallway so they could have the classroom to themselves. Through creating a visual representation of their anxiety,the participants were able to experience a commonality in shared struggle. During the debrief, the facilitator highlightedthe skills that the participants used and helped generalize the experience into strategies they could use in an actualclassroom (e.g., noise cancelling headphones, a quiet corner).Challenges of implementationCommon challenges when using Minecraft as a therapeutic tool can be generalized into the broad categories of practical,technical, and ethical. Practical challenges include such things as access to appropriate devices that can run the game,participant expectations, and maintaining a clear and consistent communication space (especially when meetingremotely). Technical challenges can include connecting participants to the shared world, the skill curve of in-gamecommands and controls, managing the built-in safety features and/or adding additional ones through modification of thegame, and troubleshooting technical problems as they arise. Ethical challenges specific to using Minecraft are primarilyfocused around maintaining privacy within a game that is designed to facilitate social interaction and friendships.While the Education Edition is not socially oriented, it is unclear if appropriate levels of security, or a business associates1Names of participants have been changed to protect participant privacy as outlined in the ethical statement.Page 9 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nagreement (BAA), are available from Microsoft, which would be important for clinical/medical settings. Across settings,facilitators should be properly trained to offer intentional interventions while maintaining participant safety with thegiven population.Potential risks of therapeutically applied MinecraftMinecraft was not designed as a therapeutic intervention and requires a significant facilitator knowledge to correctlyimplement the safety tools necessary for their group. Such safety tools can include technical interventions such as turningoff player damage or the ability to “undo”in-game player actions. Because activities take place in a virtual world, thebiggest risk to players is within social/emotional experiences, such as being a target for bullying or feelings of beingexcluded or marginalized. The flexibility and ease of access that Minecraft offers as a tool also lends itself to abuse byparticipants if good boundaries are not maintained. Minecraft has mechanics such as TNT and explosive creatures, whichcan allow participants to quickly destroy the creations of their peers. Though there is no research currently available on therisks of therapeutically applied Minecraft groups, anecdotes suggest if a facilitator is unprepared to navigate the technicalor social aspects of the group, they may fail to maintain a safe enough environment for the players, leading to unnecessaryemotional distress of players.Recommendations for future researchTherapeutic applications of video games, particularly among games that were not designed to be therapeutic (e.g.,Minecraft), is an emerging area of research. Though the rationale for the use of such games in conjunction withestablished therapeutic techniques is clear from a theoretical lens, more research is needed in this area to better understandthe potential risks and benefits of such interventions.Historically, research into youth experiences and interventions, especially among neurodivergent adolescents,has centred on the reports of parents, teachers, and other adult observers. To better understand the true impact ofinterventions on neurodivergent adolescents, the feedback of adolescents should be centred accordingly. A mixed-methods approach with opportunities for both qualitative and quantitative data should be used to understand the impact ofnovel interventions and direct future research. For example, tape review of sessions to examine changes in reciprocalcommunication between participants over time combined with, self- and observer-report measures with additional open-ended questions completed at regular intervals to track change over time. These measures should include informationabout real-world changes in behavior (or lack-thereof ). Common goals for future research groups will vary by populationand cohort, but measures selected should target the goals of the group.ConclusionsThe use of valued hobbies to support participant growth, as well as the utilization of simulations to practice new oratrophied skills are not new concepts in mental health. Advances in technology and digital games can be utilized tosupport adolescent social capacity and connection. As social connection is important for well-being, and neurodivergentyouth have higher rates of peer victimization and loneliness, identifying strategies specifically targeted to thesepopulations is important.Therapeutically applied Minecraft is an intervention designed to support the social growth of neurodivergentindividuals with respect to participant communication preferences and individual autonomy. In therapeutically appliedMinecraft groups participants meet weekly for 90 minutes to engage in facilitated activities in a virtual world. As outlinedthrough the use cases in this article, the game environment allows for low-stakes social practice in a valued activity, whichmay support motivation and engagement in social activities. Furthermore, though Minecraft is particularly well suited tosupport neurodivergent youth social development, other multiplayer digital games with collaborative play styles can alsobe appropriate for such interventions and use many of the same techniques discussed in this article.Though there is currently little academic research on the therapeutic applications, Minecraft has been increasinglypopular in community and educational settings, and future research should focus on both the possible benefits as well aspotential risks of such interventions with neurodivergent youth.Data availabilityAll data underlying the results are available as part of the article and no additional source data are required.Page 10 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nReferencesAcker L, Knight M, Knott F: ‘Are they just gonna reject me?’Male adolescents with autism making sense of anxiety:An Interpretative Phenomenological Analysis. Res. Autism Spectr.Disord. 2018; 56:9–20.Publisher Full TextAmerican Psychiatric Association: Diagnostic and statistical manual ofmental disorders (5th ed., text rev.). 2022.Publisher Full TextBaek Y, Min E, Yun S: Mining educational implications of Minecraft.Comput. Sch. 2020; 37(1): 1–16.Publisher Full TextBauminger N, Shulman C, Agam G: Peer interaction and loneliness inhigh-functioning children with autism. J. Autism Dev. Disord. 2003; 33(5):489–507.Publisher Full TextCheng D: Minecraft helps kids with autism build richer lives. CNET; 2016,March 29. Retrieved December 1, 2022.Reference SourceCilauro R: Community building through a public library MinecraftGaming Day. Aust. Libr. J. 2015; 64(2): 87–93.Publisher Full TextCook A, Ogden J, Winstone N: Friendship motivations, challenges andthe role of masking for girls with autism in contrasting schoolsettings. Eur. J. Spec. Needs Educ. 2018; 33(3): 302–315.Publisher Full TextDaniel LS, Billingsley BS: What boys with an autism spectrum disordersay about establishing and maintaining friendships. Focus Autism OtherDev. Disabl. 2010; 25(4): 220–229.Publisher Full TextDean M, Harwood R, Kasari C: The art of camouflage: Genderdifferences in the social behaviors of girls and boys with autismspectrum disorder. Autism. 2017; 21(6): 678–689.PubMed Abstract|Publisher Full TextDwyer P: The Neurodiversity Approach(es): What Are They and WhatDo They Mean for Researchers? Hum. Dev. 2022; 66(2): 73–92.PubMed Abstract|Publisher Full Text |Free Full TextFinch E: Therapeutic adventures in Minecraft. BACP Children, Young Peopleand Families; 2021. Retrieved November 29, 2022.Reference SourceGates JA, Kang E, Lerner MD: Efficacy of group social skills interventionsfor youth with autism spectrum disorder: A systematic review andmeta-analysis. Clin. Psychol. Rev. 2017; 52: 164–181.PubMed Abstract|Publisher Full Text |Free Full TextGrandin T: Case study: How horses helped a teenager with autismmake friends and learn how to work. Int. J. Environ. Res. Public Health.2019; 16(13): 2325.PubMed Abstract|Publisher Full Text |Free Full TextHedley D, UljarevićM, Foley KR, et al.: Risk and protective factorsunderlying depression and suicidal ideation in autism spectrumdisorder. Depress. Anxiety. 2018; 35(7): 648–657.Publisher Full TextHeiman T, Olenik-Shemesh D, Eden S: Cyberbullying involvementamong students with ADHD: Relation to loneliness, self-efficacy andsocial support. Eur. J. Spec. Needs Educ. 2015; 30(1): 15–29.Publisher Full TextHochman JM, Carter EW, Bottema-Beutel K, et al.: Efficacy of peernetworks to increase social connections among high school studentswith and without autism spectrum disorder. Except. Child. 2015; 82(1):96–116.Publisher Full TextHoughton S, Lawrence D, Hunter SC, et al.: Loneliness accounts for theassociation between diagnosed Attention Deficit-HyperactivityDisorder and symptoms of depression among adolescents.J. Psychopathol. Behav. Assess. 2020; 42(2): 237–247.Publisher Full TextHull L, Petrides KV, Mandy W: Cognitive predictors of self-reportedcamouflaging in autistic adolescents. Autism Res. 2021; 14(3): 523–532.Publisher Full TextJagannath K, Slovák P: Designing for Promoting Conflict-ResolutionSkills in Youth on a Moderated Minecraft Server. Proc. ACM Hum.-Comput. Interact. 2020; 4(CSCW1): 49.Publisher Full TextLeGoff D: Use of LEGO as a therapeutic medium for improving socialcompetence. J. Autism Dev. Disord. 2004; 34: 557–571.PubMed Abstract|Publisher Full TextLegoff DB, Krauss GW, Allen SL: LEGO-based play therapy forimproving social competence in children and adolescentswith autism spectrum disorders. Play-based Interventions forChildren and Adolescents with Autism Spectrum Disorders. Routledge; 2012;(pp. 143–164).Laslo-Roth R, Bareket-Bojmel L, Margalit M: Loneliness experienceduring distance learning among college students with ADHD: themediating role of perceived support and hope. Eur. J. Spec. Needs Educ.2022; 37(2): 220–234.Publisher Full TextMacCormack J, Freeman J: Part 2: The virtual environment socialprogram for youths with autism spectrum disorder. Int. J. Play Ther.2019; 28(4): 218–237.Publisher Full TextMaïano C, Normand CL, Salvas MC, et al.: Prevalence ofschool bullying among youth with autism spectrum disorders:A systematic review and meta-analysis. Autism Res. 2016; 9(6):601–615.PubMed Abstract|Publisher Full TextMicrosoft: Minecraft franchise fact sheet April 2021. 2021, April. RetrievedDecember 1, 2022.Reference Source|Reference SourceMiller D, Rees J, Pearson A: “Masking is life”: Experiences of maskingin autistic and nonautistic adults. Autism in Adulthood. 2021; 3(4):330–338.Publisher Full TextMilton DE: On the ontological status of autism: the ‘double empathyproblem’.Disabil. Soc. 2012; 27(6): 883–887.Publisher Full TextMueller AK, Fuermaier A, Koerts J, et al.: Stigma in attention deficithyperactivity disorder. ADHD Atten. Defic. Hyperact. Disord. 2012; 4(3):101–114.PubMed Abstract|Publisher Full Text |Free Full TextOrben A, Tomova L, Blakemore SJ: The effects of social deprivation onadolescent development and mental health. Lancet Child Adolesc.Health. 2020; 4(8): 634–640.PubMed Abstract|Publisher Full Text |Free Full TextOrsmond GI, Shattuck PT, Cooper BP, et al.: Social participation amongyoung adults with an autism spectrum disorder. J. Autism Dev. Disord.2013; 43(11): 2710–2719.PubMed Abstract|Publisher Full Text |Free Full TextPaulson JF, Buermeyer C, Nelson-Gray RO: Social rejection and ADHD inyoung adults: An analogue experiment. J. Atten. Disord. 2005; 8(3):127–135.PubMed Abstract|Publisher Full TextPearson A, Rose K: A conceptual analysis of autistic masking:Understanding the narrative of stigma and the illusion of choice.Autism in Adulthood. 2021; 3(1): 52–60.PubMed Abstract|Publisher Full Text |Free Full TextPellicano E, Brett S, den Houting J, et al.: COVID-19, social isolation andthe mental health of autistic people and their families: A qualitativestudy. Autism. 2022; 26(4): 914–927.PubMed Abstract|Publisher Full TextRingland KE, Wolf CT, Faucett H, et al.: “Will I always be not social?”:Re-Conceptualizing Sociality in the Context of a Minecraft Communityfor Autism. Proceedings of ACM CHI Conference on Human Factors inComputing Systems. 2016; 1256–1269.Shea B, Wiener J: Social exile: The cycle of peer victimization for boyswith ADHD. Can. J. Sch. Psychol. 2003; 18(1-2): 55–90.Publisher Full TextShkedy G, Sandoval-Norton AH, Shkedy D: The trauma of broad-basedinclusion for students with autism. Humanit. Soc. Sci. Res. 2020; 3(2):p1–p1.Publisher Full TextSibley MH, Ortiz M, Gaias LM, et al.: Top problems of adolescents andyoung adults with ADHD during the COVID-19 pandemic. J. Psychiatr.Res. 2021; 136: 190–197.PubMed Abstract|Publisher Full Text |Free Full TextSturm LP, Windsor JA, Cosman PH, et al.: A systematic review of skillstransfer after surgical simulation training. Ann. Surg. 2008; 248(2):166–179.Publisher Full TextUnnever JD, Cornell DG: Bullying, self-control, and ADHD. J. Interpers.Violence. 2003; 18(2): 129–147.Publisher Full TextViner RM, Ozer EM, Denny S, et al.: Adolescence and the socialdeterminants of health. Lancet. 2012; 379(9826): 1641–1652.Publisher Full TextWard P, Williams AM, Hancock PA: Simulation for Performance andTraining. Ericsson KA, Charness N, Feltovich PJ, et al., editors.The Cambridge handbook of expertise and expert performance. CambridgePage 11 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nUniversity Press; 2006; (pp. 243–262).Publisher Full TextWood JJ, Gadow KD: Exploring the Nature and Function of Anxiety inYouth with Autism Spectrum Disorders. Clinical Psychology: Science andPractice. 2010; 17(4): 281–292.Publisher Full TextZolyomi A, Schmalz M: Mining for Social Skills: Minecraft in Home andTherapy for Neurodiverse Youth. 50th Hawaii International Conference onSystem Sciences. 2017; pp. 3391–3400.Reference SourcePage 12 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nOpen Peer ReviewCurrent Peer Review Status:    Version 1Reviewer Report08 August 2023https://doi.org/10.5256/f1000research.141749.r187088© 2023 Santhanam S. This is an open access peer review report distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Siva Priya Santhanam 1 Department of Communication Sciences and Disorders, College of Health and Human Services, Bowling Green State University, OH, Bowling Green State University, Bowling Green, Ohio, USA 2 Department of Communication Sciences and Disorders, College of Health and Human Services, Bowling Green State University, OH, Bowling Green State University, Bowling Green, Ohio, USA This Method Article is useful as it adds to the existing literature on the value of videogames in supporting socialization among neurodivergent youth. The authors have described Minecraft as a tool to be used to support socialization among autistic youth. They described how the groups are conducted with a facilitator and provide a case example. They then summarize how the groups support socialization and reduce anxiety. Not much supporting evidence is provided in the discussion on anxiety reduction, but the focus is on how the Minecraft platform has the potential to reduce anxiety. They conclude the paper with future suggestions on how Minecraft can be utilized therapeutically.  Please see comments below to help improve the manuscript.  The format of background, method, and results does not quite fit this manuscript as it is an Method Article and not a Research Article based on empirical data. Align the abstract format with the format of the manuscript with the first paragraph starting with the purpose of the paper, a description of Minecraft, and its usefulness as a friendship intervention. Describe the method on how it is used in the method section. There are really no results for this paper. So, the abstract can be concluded with suggestions on how to implement the groups if that was the purpose of the article.  It would be helpful to state the purpose clearly. Is the purpose to teach others how to facilitate the groups? Or to describe the value of Minecraft in therapeutic settings?  Does your group focus on autistic youth only or do individuals of other neurodivergent identities join the groups as well?  Page 13 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nIn this sentence, “Therapeutically applied Minecraft groups are an intervention designed to support social engagement and growth in youth and are particularly well-suited for use with neurodivergent youth.” Are the “groups” an intervention? Please define what the intervention entails within this group. Perhaps you may want to say, “Minecraft, a commercially available digital game, serves as an intervention tool that supports social engagement.” When you use the word “growth in youth”, please mention growth of what?  What does scaffolding in Minecraft groups look like? Who does the scaffolding? Or who is ideally qualified to do the scaffolding? What training do they receive?  Please use the copyright symbol © where needed – Minecraft, Microsoft etc.  The discussion of “practicing social skills” is contradictory to the neurodiversity paradigm in that it describes autistic people as those who have “deficits” in communication.  It would be helpful to elaborate on what really is the purpose of this article besides describing the use of Minecraft therapeutic intervention.  It is not clear to me how the paragraph on masking is connected to the previous paragraph on page 4. A discussion and understand of masking and how it is associated with social isolation is helpful and necessary, but it has not been clearly laid out.  Please provide a citation for this sentence “Many neurodivergent adolescents report developing avoidance behaviours associated with social interactions, often stemming from multiple prior negative experiences with peers.”  Please provide a citation for this sentence “However, simply creating a facilitated social spacethat respects individual communication needs may not inherently increase an individual's willingness to communicate with others.”  In the paragraph on existing uses of Minecraft and the paragraph on justification for use of Minecraft, there are some overlapping points. Please consider combining the two paragraphs. It might also be helpful to explore how Minecraft is used in therapeutic settings outside of supporting autistic individuals. For example, these articles discuss the use of Minecraft in other scenarios. Using these to support the paragraphs would be a valuable addition. The article links are provided here. Mining for Social Skills: Minecraft in Home and Therapy for Neurodiverse Youth;Gliosci&Barros Pontes E Silva1;Jagannath, Salen & Slovàk2.  Further in the paragraph on justification, there are points that also tie in with points in the previous paragraph on applications with neurodivergent individuals. So, I encourage the authors to re-read and consider rewriting these sections to be mutually exclusive paragraphs of the essay.  The method of implementation is clear with case examples. Practical suggestions on how to facilitate the session would be helpful to add here for others to facilitate the groups if that was the intended purpose of the article.  Suggestions on what facilitation entails would be helpful for someone to replicate the groups as well. What is the main goal of facilitation? Page 14 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\n References 1. Gliosci R, Barros Pontes E Silva T: Therapeutic Interventions with Videogames in Treatments for Depression: A Systematic Review.Games Health J. 2023; 12 (4): 269-279 PubMed Abstract | Publisher Full Text 2. Jagannath K, Salen K, Slovàk P: \"(We) Can Talk It Out...\": Designing for Promoting Conflict-Resolution Skills in Youth on a Moderated Minecraft Server. Proceedings of the ACM on Human-Computer Interaction. 2020; 4 (CSCW1): 1-26 Publisher Full Text  Is the rationale for developing the new method (or application) clearly explained?YesIs the description of the method technically sound?PartlyAre sufficient details provided to allow replication of the method development and its use by others?NoIf any results are presented, are all the source data underlying the results available to ensure full reproducibility?PartlyAre the conclusions about the method and its performance adequately supported by the findings presented in the article?PartlyCompeting Interests: No competing interests were disclosed.Reviewer Expertise: Supporting autistic adults' social communication through gaming.I confirm that I have read this submission and believe that I have an appropriate level of expertise to confirm that it is of an acceptable scientific standard, however I have significant reservations, as outlined above.Author Response 15 Nov 2023Elizabeth Kilmer Authors’ response to reviewer with changes made for V2 of article. Reviewer commends in bold.  This Method Article is useful as it adds to the existing literature on the value of videogames in supporting socialization among neurodivergent youth. The authors have described Minecraft as a tool to be used to support socialization among autistic youth. They described how the groups are conducted with a facilitator and provide a case example. They then summarize how the groups support socialization and reduce Page 15 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nanxiety. Not much supporting evidence is provided in the discussion on anxiety reduction, but the focus is on how the Minecraft platform has the potential to reduce anxiety. They conclude the paper with future suggestions on how Minecraft can be utilized therapeutically.  Please see comments below to help improve the manuscript.  The format of background, method, and results does not quite fit this manuscript as it is an Method Article and not a Research Article based on empirical data. Align the abstract format with the format of the manuscript with the first paragraph starting with the purpose of the paper, a description of Minecraft, and its usefulness as a friendship intervention. Describe the method on how it is used in the method section. There are really no results for this paper. So, the abstract can be concluded with suggestions on how to implement the groups if that was the purpose of the article.  We appreciate the reviewer’s concern that the standard abstract format outlined by F1000 guidelines doesn’t appropriately fit this manuscript. We’ve adjusted the abstract as recommended by the reviewer.   It would be helpful to state the purpose clearly. Is the purpose to teach others how to facilitate the groups? Or to describe the value of Minecraft in therapeutic settings?  The purpose of this article is to describe a current use of Minecraft in therapeutic settings and encourage increased research in this area. We’ve clarified this purpose in the abstract, introduction and conclusion section of the article.   Does your group focus on autistic youth only or do individuals of other neurodivergent identities join the groups as well?   This group is open to youth with goals of increasing social confidence and capacity, and no specific diagnosis is required. The majority of participants across these groups have a diagnosis of autism, ADHD, and/or an anxiety related disorder, and for this paper we’re focusing more specifically around autism/ADHD diagnoses. We’ve clarified this language throughout the paper.   In this sentence,“Therapeutically applied Minecraft groups are an intervention designed to support social engagement and growth in youth and are particularly well-suited for use with neurodivergent youth.”Are the “groups” an intervention? Please define what the intervention entails within this group. Perhaps you may want to say, “Minecraft, a commercially available digital game, serves as an intervention tool that supports social engagement.” When you use the word “growth in youth”, please mention growth of what?  The groups are the intervention, and they utilize the game Minecraft to do so – we’ve adjusted our language to better clarify our meaning here. We’ve removed the phrase “growth in youth” and replaced it with more specific language.  Page 16 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\nWhat does scaffolding in Minecraft groups look like? Who does the scaffolding? Or who is ideally qualified to do the scaffolding? What training do they receive?  We’ve clarified language around scaffolding in therapeutically applied Minecraft groups and have added more information about recommendations for facilitator qualifications.  Please use the copyright symbol © where needed – Minecraft, Microsoft etc.  The manuscript is written in APA style, which does not use trademark symbols. We did make sure to identify the original studio as well as acknowledge its acquisition and ownership by Microsoft, which is done on page three.  The discussion of “practicing social skills” is contradictory to the neurodiversity paradigm in that it describes autistic people as those who have “deficits” in communication.  We understand that discussion around “practicing social skills” can be a contentious one in the neurodivergence community, especially given how the practice of social skills has often been applied in an oppressive manner to force autistic people to conform to allistic standards. We appreciate theconcern andfeedbackfrom the reviewerand have worked to adjust our language to increase clarity.We would like to note that one of the authors is ADHD and another autistic;we have personal experience with the harm thatoppressively applied interventionscan causeby an over-emphasis on fitting in and the focus on amedical/deficit-based model of disability.We use the word \"disability\" in this case due to the wildly disparate - and sometimes contradictory - ways people apply the term \"neurodiversity.\"Though we do not claim to speak for alldisabledorneurodivergent individuals, our experiences both personally and professionally continually reinforce the value of teaching and practicing social skills in ways that respect individual autonomy and preference. We believe that most individuals,regardless of disability orneurodivergent status, can benefit from learning more about communication and practicing skillsin a judgement-free environment which is supportive of their individual goals. We’ve added in additional language to clarify our alignment with an interactionist/ecological neurodiversity approach. Though beyond the scope of this paper, we believe that a failure to acknowledge challenges, needs,orimpairmentsin communication is at best naively idealistic and at worst actively ableist.To put it simply, ignoring an individual’s needs and impairments can deny them access to accommodations.Autisticand ADHD brains don’t need to be “fixed,” but we may need additional support or practice in some skills, including those that allow us to communicate with others more effectively (social skills), especially in how the other people can help accommodate our differing needs. The onus on communication should not be placed solely at the feet of neurodivergent individuals, but neither should we be denied skills in support of an ideal that aims to absolve us of disability.  It would be helpful to elaborate on what really is the purpose of this article besides describing the use of Minecraft therapeutic intervention.  The primary purpose of the article is to describe the use of Minecraft in therapeutic settings. As there is incredibly sparse information in the literature, the authors hope is that this article will help to illustrate a use of Minecraft in a therapeutic setting and inspire further research in the Page 17 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\narea.   It is not clear to me how the paragraph on masking is connected to the previous paragraph on page 4. A discussion and understand of masking and how it is associated with social isolation is helpful and necessary, but it has not been clearly laid out.  We’ve added language to further clarify how masking is associated with social isolation.   Please provide a citation for this sentence “Many neurodivergent adolescents report developing avoidance behaviours associated with social interactions, often stemming from multiple prior negative experiences with peers.”  We’ve clarified and added additional citations to this area.   Please provide a citation for this sentence“However, simply creating a facilitated social spacethat respects individual communication needs may not inherently increase an individual's willingness to communicate with others.”  We’ve added a citation for the above sentence.   In the paragraph on existing uses of Minecraft and the paragraph on justification for use of Minecraft, there are some overlapping points. Please consider combining the two paragraphs. It might also be helpful to explore how Minecraft is used in therapeutic settings outside of supporting autistic individuals. For example, these articles discuss the use of Minecraft in other scenarios. Using these to support the paragraphs would be a valuable addition. The article links are provided here.Mining for Social Skills: Minecraft in Home and Therapy for Neurodiverse Youth;Gliosci&Barros Pontes E Silva1;Jagannath, Salen & Slovàk2.  We appreciate the additional citations and recommendations regarding the structure and have combined the two sections, clarified the citations that describe populations other than solely autistic youth, included additional citations.  Further in the paragraph on justification, there are points that also tie in with points in the previous paragraph on applications with neurodivergent individuals. So, I encourage the authors to re-read and consider rewriting these sections to be mutually exclusive paragraphs of the essay.  We’re restructured the two sections to create mutually exclusive sections.   The method of implementation is clear with case examples. Practical suggestions on how to facilitate the session would be helpful to add here for others to facilitate the groups if that was the intended purpose of the article. Suggestions on what facilitation entails would be helpful for someone to replicate the groups as well. What is the main goal of facilitation?  We appreciate this feedback and have worked to clarify our language around the goal of the Page 18 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\narticle as well as for facilitation. As instruction on facilitating groups is beyond the scope of this paper, we’ve refrained from adding more specific recommendations around facilitation, though we did add additional information about qualifications for facilitators.  Competing Interests: No competing interests were disclosed.Reviewer Report26 July 2023https://doi.org/10.5256/f1000research.141749.r187083© 2023 Hutson J. This is an open access peer review report distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.James Hutson 1 Department of Art History and Visual Culture, Lindenwood University, Saint Charles, USA 2 Department of Art History and Visual Culture, Lindenwood University, Saint Charles, USA The rationale for utilizing Minecraft as a platform for therapeutic intervention is thoroughly expounded upon within the discourse. The authors highlight the game's cultural ubiquity, popularity, and the varied gameplay modes as pivotal elements that contribute to its suitability in a therapeutic context.  The popularity of Minecraft, especially among the target demographic, helps foster participant motivation and engagement. This facet is underscored by the argument that familiarity with the game can ease the transition into therapy and allow participants to assume the role of experts, thus facilitating their involvement in the therapy process. This facet is particularly salient when working with neurodivergent individuals, considering the existence of Minecraft servers and communities specifically designed for these individuals, such as Autcraft.  The description of the method for utilizing Minecraft as a therapeutic tool appears technically sound, feasible, and carefully considered for different contexts of application. The flexibility of delivery, either virtually or in-person, is an advantageous aspect, ensuring that therapy can proceed under varying circumstances.  To supplement the in-game communication channels, the suggestion for a private shared voice and video chat for virtual meetings, or a shared table setup for in-person sessions, ensures that all participants can interact seamlessly. The consideration for such details demonstrates an understanding of the importance of effective communication for the success of the group activities.  The structural breakdown of the sessions also appears well-conceived, with a mix of check-ins, game activities, and check-outs, enhancing the opportunity for participants to discuss their experiences and offer feedback. This approach is likely to facilitate the therapeutic process by providing routine and structure.Page 19 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023\n Is the rationale for developing the new method (or application) clearly explained?YesIs the description of the method technically sound?YesAre sufficient details provided to allow replication of the method development and its use by others?YesIf any results are presented, are all the source data underlying the results available to ensure full reproducibility?No source data requiredAre the conclusions about the method and its performance adequately supported by the findings presented in the article?YesCompeting Interests: No competing interests were disclosed.Reviewer Expertise: AI, neurohumanities and neurodiversityI confirm that I have read this submission and believe that I have an appropriate level of expertise to confirm that it is of an acceptable scientific standard.The benefits of publishing with F1000Research:Your article is published within days, with no editorial bias•You can publish traditional articles, null/negative results, case reports, data notes and more•The peer review process is transparent and collaborative•Your article is indexed in PubMed after passing peer review•Dedicated customer support at every stage•For pre-submission enquiries, contact research@f1000.comPage 20 of 20F1000Research 2023, 12:216 Last updated: 20 NOV 2023"
    },
    {
        "name": "Constructing in Minecraft in Primary School as a Boundary-Crossing Practice",
        "url": "https://www.researchgate.net/publication/377371524_Constructing_in_Minecraft_in_Primary_School_as_a_Boundary-Crossing_Practice?_sg=eCaW3gAa6tYRI70vwBDznAuRZXfyKFt3PzDr3cBbLyXTT-Uibt_eS7tz6QijaAg3EsxAPqVlT-asXCQ",
        "text": "Citation: Ritella, G.; Marcone, R.Constructing in Minecraft in PrimarySchool as a Boundary-CrossingPractice. Educ. Sci. 2024,14, 85.https://doi.org/10.3390/educsci14010085Academic Editor: Maiga ChangReceived: 4 December 2023Revised: 5 January 2024Accepted: 9 January 2024Published: 12 January 2024Copyright: © 2024 by the authors.Licensee MDPI, Basel, Switzerland.This article is an open access articledistributed under the terms andconditions of the Creative CommonsAttribution (CC BY) license (https://creativecommons.org/licenses/by/4.0/).education sciencesArticleConstructing in Minecraft in Primary School as a Boundary-Crossing PracticeGiuseppe Ritella 1, 2, *and Roberto Marcone 11Department of Psychology, University of Campania, 81100 Caserta, Italy; roberto.marcone@unicampania.it2Faculty of Educational Sciences, University of Helsinki, 00100 Helsinki, Finland*Correspondence: giuseppe.ritella@unicampania.itAbstract: This study explores the educational adoption of Minecraft as a boundary-crossing practicein primary schools. Previous research indicates that Minecraft can facilitate connections betweeneducational activities and students’ out-of-school experiences, promoting the development of skillssuch as creativity, innovation, and collaboration. Using a qualitative approach, this study analyzedgroup interviews with 37 primary school students who participated in a Minecraft-based schoolproject. The analysis focused on instances of boundary crossing associated with the Minecraft activity,allowing an examination of how various socio-cultural boundaries were overcome. The resultssuggest that educational activities in Minecraft can facilitate connections between school and out-of-school contexts. Moreover, the results indicate that Minecraft can serve as an interdisciplinarylearning environment, enabling students to acquire knowledge and skills across diverse domains anddisciplines. The analysis also underscores the signiﬁcance of teachers’ design work in transformingthe game into an educational resource. Overall, this article argues that the educational adoptionof Minecraft has the potential to foster the construction of continuity between students’ differentspheres of life, as well as prompting a reconsideration of students’ previous cultural classiﬁcationsand social positions.Keywords: Minecraft; boundary crossing; boundary object; qualitative analysis1. IntroductionOver the past two decades, an expanding body of academic literature has explored thepotential of games as valuable learning tools across various contexts and disciplines[1–3].Within this literature, many authors have documented the educational relevance ofMinecraft, which is an extremely popular digital game featuring an edition designedspeciﬁcally for educational use [4–7]. In particular, some scholars have discussed howMinecraft provides a open and ﬂexible environment and allows for a wide range of learningactivities, including problem-solving, critical thinking, and collaboration [6,8]. In addition,recent studies demonstrated how the use of Minecraft in schools promotes the acquisitionof skills related to creativity and innovation, as well as communication and collabora-tion [9]. Furthermore, according to some authors, the adoption of games in educationalcontexts tends to blur the boundaries between in- and out-of-school contexts [10], poten-tially facilitating connections between educational activities and students’ out-of-schoolparticipation. For example, Pettersen and colleagues [11] have explored how digital literacypractices enacted in Minecraft allow for the emergence of new agencies and new formsof “hybridity”.The emphasis on viewing learning processes as something that can transcend tradi-tional classroom boundaries, rather than being conﬁned within the school environment [12],is particularly relevant given the ongoing shifts in the educational landscape. Indeed, theadoption of digital and mobile technology as well as the development of novel pedagogicalapproaches—such as connected learning [13]—have been challenging the traditional clear-cut boundaries deﬁning where and when learning takes place [14,15]. In response to theseEduc. Sci. 2024,14, 85. https://doi.org/10.3390/educsci14010085 https://www.mdpi.com/journal/education\nEduc. Sci. 2024,14, 85 2 of 19and other societal shifts, many educational institutions are actively working to establishconnections with a range of various out-of-school experiences that students engage in [16].These societal changes require acknowledging the signiﬁcance of learning that occursoutside of the classroom [17].A valuable framework for understanding learning across contexts can be found inthe literature on “boundary crossing” [18]. Grounded in the third generation of cultural-historical activity theory [19,20] and related situated and socio-cultural approaches tolearning [21,22], this body of literature offers a nuanced perspective on learning and socialinteraction across contexts. This body of literature conceptualizes contexts as practicesor activity systems that are both culturally and historically informed, yet continuously(re)constructed. A boundary-crossing perspective sensitizes us to how learning may takeplace across contexts despite differences in the purposes, meanings, and forms charac-terizing each context. Learning across contexts can therefore be viewed as a process ofengagement with a particular content or activity not constrained within any speciﬁc context.Boundary crossing can be captured by examining the (dis)continuity of learning acrosscontexts [16].Several authors have examined the use of various objects and technologies as toolsable to facilitate boundary crossing—labeled as “boundary objects”—often emphasizing thepotential and affordances of technologies to connect learning contexts [23]. Based on such aconceptualization, a recent study on the educational adoption of games [24] conceptualizedMinecraft as a boundary object enabling the emergence of boundary crossing betweenformal and informal learning. According to these authors, as a virtual world, Minecraftprovides a platform for children to explore and experiment with educationally relevantphenomena and concepts both in formal and informal settings, thus bridging the gapbetween formal and informal learning.Nevertheless, our understanding of the boundary-crossing processes associated withthe educational use of videogames is still limited. For example, little is known about howstudents make sense of boundary crossing taking place during educational activities involv-ing gaming and how they discursively connect it with their learning trajectories. Sheddinglight on this aspect is important because computer games are not good learning resourcesby themselves. Rather, they are ﬂexible artifacts that may take on different meaningswhen adopted across different learning contexts, being transformed into learning resourcesthrough the sensemaking of the individuals engaging with them in practice[11,25]. Oneaspect that might affect such sensemaking is the previous experience that the students havewith the game before engaging with it for an educational activity. Indeed, it is reasonableto expect that having previously played a game for leisure might affect how a studentapproaches its usage for educational aims. Furthermore, existing scholarly work tendsto address the boundaries between in-school and out-of-school contexts without delvinginto the potential variety of boundary types that students encounter (and traverse) whenengaging in educational gaming activities.The present study aims to contribute to the literature on the boundary-crossing pro-cesses associated with the educational adoption of games by analyzing how boundarycrossing is discursively constructed by the students attending an extensive educationalactivity in Minecraft lasting 2 school years. In particular, we discuss which kind of bound-aries are mentioned by the students during narrative descriptions of episodes involvingboundary crossing, how the students account for the role of different actors during theseevents, and the learning implications that can be inferred from the students’ discourse.In the next section, we brieﬂy introduce the theoretical framework of the study, largelyinformed by the literature on boundary crossing and boundary objects [16,18] and byprevious investigations examining students’ media literacies and educational games [8,11].Subsequently, we describe the context and participants involved in this study, the methodsfor data collection and analysis, and present the results. Finally, we discuss our ﬁndings,focusing on both theoretical and practical implications.\nEduc. Sci. 2024,14, 85 3 of 192. Theoretical FrameworkAs outlined in the inﬂuential literature review by Akkermann and Bakker [18], thenotion of “boundary” has been examined across a broad spectrum of social sciences tounderstand how “markers of difference” are created, perpetuated, or contested at variouslevels. Within the realm of educational theory, there is a particular interest in investigatingthe dynamics and learning mechanisms associated with social and cultural boundaries [26].In this context, a boundary can be seen as a sociocultural difference leading to “discontinuityin action or interaction” [18]. Boundary crossing, instead, is deﬁned as the deliberate effortsto establish or restore continuity in action or interaction across different contexts andpractices, at the individual, group, or institutional level [27].Simultaneously engaging in different practices also involves the shifting betweendifferent ways of positioning oneself [28]. According to this view, the engagement ineducational activities and the learning processes that stem from them can be shaped andmediated by the particular social roles and cultural classiﬁcations at play, which all involvethe establishment, maintenance, or redeﬁnition of some kinds of boundaries. For example,a student might position themselves as a gamer, as a student, as a girl, and so on. Each ofthese positions can be interpreted as different from other positions and social roles.These social and cultural distinctions are frequently intertwined with chronotopicrelations, encompassing spatial and temporal boundaries [29,30]. Indeed, when participantsmake sense of a learning activity and of their participation in it, they also deﬁne it in termsof what spatial and temporal boundaries are considered relevant [31]. Thus, learners deﬁneand mark the boundaries of the learning situation both in terms of space and time and interms of social roles and cultural classiﬁcations appropriate for the situation. Accordingly,the boundary-crossing literature examines how people may collaborate across variousplaces, times, and activities, or make connections between various practices or contexts byenacting various kinds of social positions. In this sense, contexts of learning are not “staticbackgrounds” [16]. Indeed, individuals are not just situated “in” a context but also sociallyconstruct that same context [32].In this ﬁeld, it has been argued that people have the capacity to establish connectionsbetween learning contexts by engaging in processes of sense-making, translation, andintegration, which might also involve the introduction of elements from one domainof practice into another [33]. Thus, learning processes are expected to extend acrossvarious contexts, with diverse participants, settings, and experiences all contributing to thegradual development of expertise and continued participation within a speciﬁc domain overtime. Multiple scholars (e.g., [17,34]) have observed how young children often accumulatesigniﬁcant knowledge in areas of personal interest across multiple contexts, and that suchlearning may intersect with knowledge domains relevant to educational contexts.Individuals who can integrate elements from one practice into another have been de-noted as “brokers” [35], “boundary crossers”, or “boundary workers” [36]. The signiﬁcanceof such individuals is rooted in their proﬁciency to transition and forge connections, therebyfacilitating collaboration and alignment between distinct practices or activity systems. Itis worth noting that boundary crossers or brokers frequently navigate domains wheretheir expertise may not be all-encompassing, and they can assume a multifaceted role [33].Indeed, they contend with the intricate task of negotiating and amalgamating elementsfrom diverse contexts to formulate hybrid scenarios [37]. Nevertheless, these challengesunderscore the potential for learning through boundary crossing. It is therefore crucialfor scholarship on these processes to discuss who are the actors of boundary crossing andhow they are described—in terms of social positions and cultural classiﬁcations—by theparticipants in boundary-crossing situations.In addition to individuals, both real and virtual objects can play a crucial role inboundary crossing. Science and technology studies, for example, have explored howobjects can facilitate communication and collaboration across different contexts [18]. Theterm “boundary object” has long been employed to describe and examine the role ofartifacts that serve as connectors among different practices [38]. Boundary objects are\nEduc. Sci. 2024,14, 85 4 of 19deﬁned as objects that serve the informational needs of multiple intersecting domainsand can adapt to the unique requirements and constraints of the various parties involved.Despite their adaptability, boundary objects also maintain a consistent identity acrossdifferent contexts [38].Boundary crossing can have signiﬁcant implications for learning and development.By encountering unfamiliar contexts and negotiating differences, learners can developnew skills, knowledge, and perspectives that can enhance their professional practice. Forexample, boundary crossing can facilitate the creation of hybrid situations that drawon the strengths of different contexts, leading to innovative solutions and practices [18].Furthermore, boundary crossing can promote reﬂexivity and critical thinking, as learnersare forced to question their assumptions and engage in dialogue with others who havedifferent perspectives. Overall, boundary crossing is often considered a powerful toolfor learning and can lead to more effective and innovative practices in a range of ﬁelds,including educational practices based on virtual games such as Minecraft [6].3. Aims and Research QuestionsThe main aim of the present study is to discuss possible instances of boundary crossingidentiﬁed in the students’ accounts of the didactic activities carried out utilizing MinecraftEducation Edition. The research questions can be summarized as follows:•What types of sociocultural boundaries are involved in the instances of boundarycrossing detected in the students’ speech?•What is the role of different actors in the instances of boundary crossing detected inthe students’ speech?•What are the possible interconnections between boundary crossing and the learningprocesses as represented in the students’ speech?•Are there differences in boundary crossing based on the students’ previous experiencein Minecraft?4. Context and ParticipantsThis study is part of a larger research project on the use of Minecraft as a tool forteaching and learning in primary school classrooms. This study was conducted in twosections of a primary school in Puglia, in the south of Italy, corresponding to the fourthand ﬁfth grades in the academic years 2019/2020 and 2020/2021, respectively. A totalof 50 students participated in the Minecraft activities (23 female, 27 male), aged 9–10,from diverse socioeconomic and cultural backgrounds. Even though all the students wereinvited to participate in the group interviews, 37 students attended the meetings when theinterviews were conducted.The teacher who designed and implemented the educational activities examinedin this investigation had previously attended a course on the didactic use of Minecraftorganized by the Italian National Institute for Documentation, Innovation, and EducationalResearch (INDIRE, a key research organization that collaborates closely with the Italianschool system, focusing on teacher training, innovation, and e-learning. INDIRE is integralto Italy’s National Evaluation System for Education and Training, striving to improveeducation quality and student achievements). This course aimed to promote the use ofMinecraft as a tool for teaching and learning in Italian schools and provided trainingand support to teachers who wanted to use Minecraft in their classrooms, as well asaccess to Minecraft Education Edition, a version of the game speciﬁcally designed foreducational purposes.The teacher had initially planned to carry out the activities with Minecraft in theclassroom, but with the arrival of the lockdown, she redesigned the teaching activity byinviting her students to explore Minecraft from home and assigning open-ended tasksthat involved the construction of different types of buildings. During the ﬁrst lockdown(spring of 2020), the students were invited to build familiar objects such as vegetablegardens, furnished houses, and amusement parks. In this phase, the students had a\nEduc. Sci. 2024,14, 85 5 of 19high degree of freedom, and the main aim was to guide them in exploring the virtualenvironment and learning to navigate it. During the school year 2020–2021, the educationalactivities in Minecraft were connected to the school curriculum. In this phase, the studentswere asked to build a Ziggurat, connecting the activity to knowledge of the history andgeography curriculum.The activities were signiﬁcantly affected by the policies and guidelines issued by theMinistry of Education and by regional authorities in the different phases of the pandemic.Speciﬁcally, during lockdown periods, the activities were conducted at home, while for mostof the 2020–2021 school year, a hybrid education approach was adopted. This involvedsome students who engaged with the project from the school premises, while otherswere participating remotely from home. The teacher organized the collaborative learningactivities in small groups but allowed for individual participation depending on localconstraints (e.g., unsolvable technical difﬁculties encountered by the children when tryingto collaborate in Minecraft). In addition, she deﬁned together with the pupils a shared classetiquette aimed at maintaining a positive class climate of sharing and mutual respect, sharedvideo tutorials regarding the construction of speciﬁc objects in Minecraft and arrangedvirtual or physical meetings during which the students were able to share their progress inMinecraft as well as to discuss possible difﬁculties and ongoing challenges.In the next section, we will present the major features of Minecraft, which are relevantto data interpretation. Indeed, as claimed by Clark, Tanner-Smith, and Killingsworth [39]the game mechanics and other characteristics of game design are signiﬁcant aspects to beconsidered when discussing the educational use of digital games.MinecraftMinecraft is a popular sandbox video game available on multiple platforms, includingPC, Xbox, PlayStation, and mobile devices. In Minecraft, players are placed in a randomlygenerated world made up of blocks of different materials. In Minecraft, players can usevarious types of blocks to create a wide range of structures and designs, from simple housesto complex machines.The game has two main modes: survival mode and creative mode. In survival mode,players must gather resources (including food) and build a shelter to survive againstchallenges including monsters and environmental hazards. In creative mode, players haveunlimited resources and can build whatever they want without worrying about monstersor hunger. Minecraft can be considered a “digital making platform” [8] that allows playersto engage in a wide range of creative and collaborative activities. The open and ﬂexibleenvironment provided by the game allows players to experiment with different (virtual)materials and tools, and to create their structures and designs.Minecraft can also be considered as a virtual social space, where players can interactwith each other and learn from each other’s creations. The game also features an EducationEdition speciﬁcally designed to enhance the learning experience and make it more suitablefor classroom use. For example, it allows the teacher to have some control over the in-gameenvironment and includes some additional tools such as the virtual chemistry lab. Minecrafthas been used in various educational settings and has been praised for its ability to fostercreativity, problem-solving skills, and collaboration. It has been used to teach subjects suchas math, science, and language arts, as well as to develop social and emotional skills.5. Materials and MethodsThe present study adopted a qualitative methodological approach based on the analy-sis of 8 group interviews (Table 1) designed and conducted to elicit a deeper understandingof the participants’ experiences and perspectives related to their use of Minecraft withinboth educational and non-educational settings. The researchers invited all the students in-volved in the project in Minecraft to participate in one of the group interviews and collectedthe parents’ informed consent for participation in the research. Out of the 50 students whowere involved in the Minecraft project, 37 opted to take part in one of the group interviews.\nEduc. Sci. 2024,14, 85 6 of 19The interviews were conducted in small groups of four to six students and were recordedand transcribed for analysis. The researchers had prepared a set of interview questionsbut adapted how and when the questions were asked in response to the unfolding conver-sation with the participants [40]. Such a semi-structured approach allowed for both theexploration of predetermined topics and the ﬂexibility to delve into unexpected insights,ensuring a well-rounded dataset.Table 1. Group size, length and composition of each interview.Interview Group Size Length (Minutes) CompositionA 5 65 1 male, 4 femaleB 4 77 1 male, 3 femaleC 6 62 4 male, 2 femaleD 4 63 4 male, 0 femaleE 6 84 3 male, 3 femaleF 4 37 1 male, 3 femaleG 4 36 3 male, 1 femaleH 4 51 3 male, 1 femaleThe group interviews were analyzed through qualitative content analysis [41] involv-ing the following steps:1. Transcription of the group interviews, which were anonymized using pseudonyms.2.Categorization of the students based on their previous experience with Minecraft. Thestudents who declared that they had never played Minecraft before the school projectwere categorized as “novice”; those who declared that they at played for less than1 year were categorized as “intermediate”; and the students who declared that theyhad played for more than one year were categorized as “experienced”.3.Iterative coding [42] of the utterances relevant to the research questions by two coders,focusing on:a.Types of boundaries associated with the instances of boundary crossing narratedby the students;b. Roles of the actors involved in boundary crossing;c.Possible interconnections between boundary crossing and the learning pro-cesses implicitly or explicitly represented in the students’ speech.4.Discussion within the research group concerning the utterances coded differently bythe two coders until complete agreement was reached (see Table 2for an overview ofthe ﬁnal categories).5.Quantitative analysis of the frequency of the codes and construction of summarytables and visual representations of the categories emerging from the coding6.Interpretation of the data and in-depth qualitative analysis of a selection of relevantexcerpts.6. ResultsTable 2summarizes the ﬁnal categories of analysis. The students’ speech during thegroup interviews contains several utterances in which a movement across socio-culturalboundaries is described. In particular, the ﬁrst category (see Figure 1)—crossing socio-cultural boundaries—contains excerpts in which the students describe how they couldovercome some barriers or redeﬁne elements of discontinuity associated with socio-culturalcategories in a transformative way. These excerpts contain references to boundaries betweensocial groups or remarks about differences between social identities or social represen-tations of relevant elements of the pedagogical activity, which are overcome during theactivity. The content in this category allows us to discuss how the emergence of boundary\nEduc. Sci. 2024,14, 85 7 of 19crossing was intrinsically connected with the redeﬁnition of some cultural categories bythe students. As shown in Figure 1, the most frequent socio-cultural boundaries mentionedby the students concerned the perception of discontinuity between leisure and education(14 occurrences) and social barriers (13 occurrences). Interestingly, a relatively high numberof students also mention episodes of boundary crossing across school disciplines (11 occur-rences), allowing us to infer that the activity in Minecraft was perceived as interdisciplinary.To a lesser degree, the discontinuity between family and school (nine occurrences) and be-tween leisure and education activities (eight occurrences) is relevant for boundary-crossingepisodes. In six episodes, the students narrate boundary crossing involving discontinuityassociated with gender. In addition, in some excerpts, the students describe the role of oneor more actors playing a critical role in the boundary-crossing process, which was codedin the category labeled “brokers”. Finally, the episodes in which the students’ accountallowed us to infer that boundary-crossing processes were associated with the emergenceof learning opportunities were coded as “learning opportunity”.Table 2. Summary of categories and codes.Category Code Description OccurrencesCrossingSocioculturalBoundariesGenderUtterances in which it is possible to infer a boundary-crossingprocess that allows to overcome or redeﬁne facets ofdiscontinuity associated with gender categories.6Family-educationUtterances in which it is possible to infer a boundary-crossingprocess that allows to overcome or redeﬁne facets ofdiscontinuity between the family and school context.9Social barriersUtterances in which it is possible to infer a boundary-crossingprocess that allows to overcome social barriers or redeﬁne facetsof discontinuity related to social interaction.13Gaming-educationUtterances in which it is possible to infer a boundary-crossingprocess that allows to overcome or redeﬁne facets ofdiscontinuity between the culture of gaming and education.8Leisure-educationUtterances in which it is possible to infer a boundary-crossingprocess that allows to overcome or redeﬁne facets ofdiscontinuity between pedagogical tasks and leisure time.14SchoolDisciplinesUtterances in which it is possible to infer a boundary-crossingprocess that allows to overcome or redeﬁne facets ofdiscontinuity between different disciplines.11Boundary CrossingBrokers BrokersUtterances in which the students provide informationconcerning one or more actors playing a crucial role for theemergence of boundary crossing.19Learningopportunities Learning opportunityUtterances in which the students’ account allows to infer thatboundar-crossing processes were associated with opportunitiesfor learning.35Since the codes adopted in this study were not mutually exclusive, often more than onecode was applied to several excerpts. For example, an excerpt might contain at the sametime a narrative account of an instance of boundary crossing between family culture andschool culture, a description of the role of a crucial actor triggering the boundary-crossingprocess, and a hint to a learning opportunity stemming from the boundary-crossing process.In this case, the same excerpt could be coded at the same time as (1) family-education,(2) brokers, and (3) learning.In the following subsections, we present the analysis of a selection of representativeexcerpts that allow us to advance our understanding of how boundary-crossing processestaking place during the activities in Minecraft were experienced by the students and toaccount for their signiﬁcance for learning processes. To avoid unnecessary fragmentation\nEduc. Sci. 2024,14, 85 8 of 19in the presentation of the analysis, we organize the following subsections based on thecodes belonging to the category “Crossing Sociocultural Boundaries” and discuss theboundary-crossing brokers and the learning opportunities when relevant in the analysis ofthe excerpts rather than creating additional subsections for the last two categories. Finally,we present the ﬁndings related to the fourth research question, which explores if and howthe students’ previous experience in Minecraft might affect boundary-crossing processes.Educ. Sci. 2024, 14, x FOR PEER REVIEW  8 of 19   Figure 1. Occurrences of codes applied to the socio-cultural boundary-crossing events. Since the codes adopted in this study were not mutually exclusive, often more than one code was applied to several excerpts. For example, an excerpt might contain at the same time a narrative account of an instance of boundary crossing between family culture and school culture, a description of the role of a crucial actor triggering the boundary-crossing process, and a hint to a learning opportunity stemming from the boundary-cross-ing process. In this case, the same excerpt could be coded at the same time as (1) family-education, (2) brokers, and (3) learning.   In the following subsections, we present the analysis of a selection of representative excerpts that allow us to advance our understanding of how boundary-crossing processes taking place during the activities in Minecraft were experienced by the students and to account for their signiﬁcance for learning processes. To avoid unnecessary fragmentation in the presentation of the analysis, we organize the following subsections based on the codes belonging to the category “Crossing Sociocultural Boundaries” and discuss the boundary-crossing brokers and the learning opportunities when relevant in the analysis of the excerpts rather than creating additional subsections for the last two categories. Fi-nally, we present the ﬁndings related to the fourth research question, which explores if and how the students’ previous experience in Minecraft might aﬀect boundary-crossing processes. 6.1. Crossing Gender Boundaries This code was applied to six excerpts in which a few female students delineated a process of boundary crossing, wherein Minecraft was initially categorized as a “game for boys” (as described by Fabiola in Excerpt 1) or dismissed as a “stupid game” (as expressed by Chiara in Excerpt 2). However, as they engaged in the pedagogical activity, the stu-dents reevaluated their cultural perceptions, occasionally suggesting a potential shift in the way they represented their identity in discourse. For example, in Excerpt 1, Fabiola explains that when she was younger, she considered Minecraft as a game for boys and that for this reason she initially was not commied to using it for learning purposes. In-terestingly, in her account, the ﬁrst aempt at using Minecraft within the school project was not suﬃcient to change her perceptions concerning the game. Only thanks to the con-vincing arguments and the help of her brother did she change her mind and afterward she started to enjoy the game and use it often, both in school and in out-of-school contexts, as she clariﬁes in other excerpts of the same interview. Excerpt 1 (Interview B) Fabiola: Minecraft… I had heard of it and in reality, at the beginning, I did not like it, a lot of people made me try it, but I never liked it because they said there were some… I mean… a game for male guys… when I was younger. Then, when you [teachers and researchers] gave the passwords I tried but… after… during the pandemic my brother convinced me, thanks to him I engaged more with Minecraft and now I like it and I play often… Figure 1. Occurrences of codes applied to the socio-cultural boundary-crossing events.6.1. Crossing Gender BoundariesThis code was applied to six excerpts in which a few female students delineated aprocess of boundary crossing, wherein Minecraft was initially categorized as a “game forboys” (as described by Fabiola in Excerpt 1) or dismissed as a “stupid game” (as expressedby Chiara in Excerpt 2). However, as they engaged in the pedagogical activity, the studentsreevaluated their cultural perceptions, occasionally suggesting a potential shift in the waythey represented their identity in discourse. For example, in Excerpt 1, Fabiola explainsthat when she was younger, she considered Minecraft as a game for boys and that for thisreason she initially was not committed to using it for learning purposes. Interestingly, inher account, the ﬁrst attempt at using Minecraft within the school project was not sufﬁcientto change her perceptions concerning the game. Only thanks to the convincing argumentsand the help of her brother did she change her mind and afterward she started to enjoy thegame and use it often, both in school and in out-of-school contexts, as she clariﬁes in otherexcerpts of the same interview.Excerpt 1 (Interview B)Fabiola: Minecraft. . .I had heard of it and in reality, at the beginning, I did notlike it, a lot of people made me try it, but I never liked it because they said therewere some. . .I mean. . .a game for male guys. . .when I was younger. Then,when you [teachers and researchers] gave the passwords I tried but. . .after. . .during the pandemic my brother convinced me, thanks to him I engaged morewith Minecraft and now I like it and I play often. . .In our interpretation, Fabiola’s narrative suggests that she reshaped the boundariesof a cultural categorization (distinguishing games for males from games for females),which had previously hindered her involvement in the task. This passage is noteworthybecause it shows how boundary crossing can not only be conceptualized as the movementof individuals across socio-cultural realms (in this case, delineated by gender-speciﬁccategories), but can also involve a subsequent transformation of the boundary at stake.Indeed, after she “crossed the boundary” between games for males and games for femalesas she originally perceived it, she appeared to no longer view Minecraft as belonging to theformer category, thereby redeﬁning the boundary at stake. In this way, boundary crossingalso displays its learning potential, not in terms of acquiring disciplinary content but interms of participation in social practices that were not precluded because of taken-for-granted cultural categories.\nEduc. Sci. 2024,14, 85 9 of 19Excerpt 2, narrated by Chiara, tells a similar story to Fabiola’s (see Excerpt 1). Chiarainitially describes Minecraft as a stupid game but discusses how during the educationalactivity, she discovered that she liked it and found it useful, also thanks to her cousin.Excerpt 2 (Interview E)Chiara: well, if I have to tell you the truth, in the beginning, I mean, I had heardof it [meaning Minecraft] but I. . .I thought it was a stupid game like. . .whereyou could not do anything useful, but then I discovered that it was nice, and youcan do a lot of things, and the creativity is really. . .well you can create anything,any object or palace. . .and my cousin who is very good helped me, but at thebeginning, also watching the YouTubers as also Elvira said, I did not understandanything, I thought I was stupid, but then I discovered a new reality where youcan free your imagination.What is noteworthy in this excerpt is that after a trajectory of boundary crossing likethat described by Fabiola in Excerpt 1, which also involves the contribution of a familymember, Chiara adds some additional reﬂections concerning her perception of self-efﬁcacy.While in the beginning, despite her efforts, she was not able to understand the game tothe point that she thought she was “stupid”, afterward she discovered a “new reality”where she could express her creativity, overcoming her initial feeling of low self-efﬁcacy inrelation to the game.It is worth noting that in both these excerpts, a family member played a signiﬁcantrole in the students’ account of their appropriation of Minecraft, so these family memberscan be considered as boundary-crossing brokers. Fabiola’s brother acted as a “boundary-crossing broker” since his intervention is described as crucial for the whole process ofchange described in the excerpt. In this sense, the cultural inputs coming from the familyin Fabiola’s case are intrinsically connected with her changing her categorization of gamesfor males and indirectly provide valuable learning resources for the educational activity.In the next section, we will further discuss the connections between the school cultureand the family culture that emerged from the students’ account of their educational use ofMinecraft, while in the subsequent subsections, we will also provide an excerpt to discussthe role of the teacher as a boundary-crossing broker.6.2. Boundary Crossing between School Culture and Family CultureThis code was applied to nine excerpts in which the students’ narrative shows howthe boundaries between the different cultures experienced at school and within the familyenvironment are permeable and allow for signiﬁcant processes of boundary crossing. In allof the excerpts included in this category, some osmosis between family and school culturesis described by the students as they narrate their perspectives on the activities in Minecraft.In the previous section, we mentioned how family members can act as boundary-crossingbrokers promoting students’ engagement in gameful educational activity and aiding inthe transition across socio-cultural boundaries. However, the data also include excerpts inwhich the boundary crossing is experienced by the students’ family culture thanks to theparticipation in the school project in Minecraft. A good example in this sense is the caseof Natale (Excerpt 3), who explained that during the project, his mother became so fondof Minecraft that she decided to buy him an expensive edition of the game, even thoughshe had previously been very “strict” about the fact that she should not buy any othervideogames for him.Excerpt 3 (Interview D)Natale: In my opinion, the only not-so-great thing about Minecraft, but it’s notreally about the game itself. . .but external, is that you have to pay for it. But mymom, even though she was strict about not buying more games for the computer,not buying them. . .then getting to know Minecraft, which is an awesome gamefor her too. . . she got it for me. She got me the best version, the Java Edition!\nEduc. Sci. 2024,14, 85 10 of 19Excerpt 3 is noteworthy because witnessing the learning experience at school duringthe project triggered a boundary-crossing process in which some changes concerningthe meaning-making of gaming occurred within the students’ families, to the extent thatNatale’s mother reconsidered her opinion about videogames and the possibility of buyingone for her son.Excerpt 4, meanwhile, is signiﬁcant because it shows how a student (Elisa) engagedin an activity in Minecraft that was speciﬁcally aimed at creating a bridge between theschool culture and the family culture. Indeed, in Excerpt 4, Elisa describes how she usedMinecraft, which she learned to use at school, to realize in the virtual world a constructionthat she deﬁnes as “her mom’s wish”.Excerpt 4 (Interview B)Elisa: Some time ago, I made my mom’s wish come true. She really wantedhouses for the three of us sisters, all close to each other. So, I did it in Minecraft. . .and it’s really cool because it allowed me to create things that you might imaginebut you can’t always have.In our interpretation, Excerpt 4 shows an instance of boundary crossing in whichElisa uses Minecraft as a boundary object between school and family. Rather than beingconceived by Elisa only as a game for entertainment and/or as a tool for learning, Minecraftin the event described by Elisa becomes a boundary object appropriated at school but alsoadopted to mediate family relationships.In the next section, we will focus on the excerpts from the interviews in which thestudents describe social boundaries and the processes through which they were able toovercome them during the project.6.3. Crossing Social BoundariesThe third category we discuss contains the speech in which the students discusshow the activity in Minecraft allowed them to overcome some kind of social barriers.We identiﬁed 12 instances in this category. For example, in Excerpt 5, Alba states thatmany other games did not allow her and her classmates to play collectively. In contrast,playing Minecraft was a positive experience for her because the activity involved the wholeclassroom, so she was able to “have fun” with all of her classmates.Excerpt 5 (Interview C)Alba: I really loved the fact that you could play at it with friends because. . .wellthere are many games. . .mhh. . .that run. . .obviously but Minecraft, Minecraftis. . .well let’s say that many times we were not able to play together with friendsin other games, but Minecraft since it was a thing for the whole class we wereable to have fun all togetherExcerpt 5 allows us to discuss how some participants considered the activity inMinecraft as a collective activity, allowing them to engage in social interaction that theyconsidered signiﬁcant. In the excerpt, Minecraft is compared to other games that on thecontrary did not allow Alba to play with her friends. Interestingly, in the excerpt, Albaseems to conﬂate the concepts of friends and classmates.In Excerpt 6, we can gain further insights concerning some processes that facilitatedthe overcoming of social boundaries during the activities in Minecraft. In this excerpt,Chiara reﬂects on the fact that the activities in Minecraft helped her to develop a closerrelationship with some of her classmates. Indeed, she remarks that before the project,her interactions with some of her peers were limited, as she did not engage in extensiveconversations with them. However, thanks to the composition of the groups designed bythe teacher, she could interact and get to know some of her classmates better. This excerptalso demonstrates the importance of the design work undertaken by the teacher to promotethe transformation of the game into an educational resource.\nEduc. Sci. 2024,14, 85 11 of 19Excerpt 6 (Interview E)Chiara: Minecraft also had this function ((gesture-making air quotes)) in the sensethat the teacher created some groups and she did not put together the childrenwho so to say you knew the best with whom you spoke more but she put me withpeople with whom I did not speak much and then anyway I rediscovered thesepeople because I did not speak much with them I mean yes Hi, good morning,or. . .in the whole class group but not so much so I think that it was also anactivity to allow us to socialize, in my view really beautiful. . .The two excerpts discussed in this category allow us to discuss how some of thestudents reﬂected on the social processes taking place during the project. In particular,Alba seems to attribute the possibility of overcoming some preexisting social boundaries toboth the technical features of Minecraft (since unlike other games it allows one to play inmultiplayer mode) and the fact that the project involved the whole classroom (so that they“could have fun all together”). Chiara, instead, depicts the teacher as a boundary-crossingbroker, since she noticed that it was exactly the rationale that the teacher adopted forcreating the groups that allowed her to “socialize” with some of her classmates.In the next section, we will brieﬂy examine two excerpts that allow us to discuss howthe students’ work took place at the boundary between the community of Minecraft gamersand the school context.6.4. Boundary Crossing between School Culture and Gaming CultureThe ﬁrst excerpt from this category, Excerpt 7, illustrates how the activity in Minecraftinvolves the integration of the school culture and the gaming culture that in the interviewsis often symbolized by the YouTubers who share tutorials and game sessions that becomeuseful resources for the participants. During the group interviews, eight students explicitlymentioned YouTube videos as useful resources for learning to navigate Minecraft and forengaging with the tasks that the teacher assigned. In a different section of the interview,Elvira mentioned that while playing Minecraft, she gained knowledge through mutualadvice exchange with her friends, and in Excerpt 5, she places signiﬁcant emphasis on howvideos from YouTubers played a crucial role in shaping her learning journey.Excerpt 7 (Interview E)Elvira: so I had never played Minecraft before the teacher told us. . .I had hearda lot about it. And when the teacher made us know it, I became passionate aboutit, I so to say started watching the videos of the YouTubers on Minecraft also inorder to learn some techniques and stuff, and now I also have Minecraft Javaedition because I liked it too much and I also created my own server in order toplay with my friends and so. . .What makes Excerpt 7 particularly intriguing is that it highlights the learning op-portunities embedded within boundary-crossing experiences. Elvira, who had no priorexperience with Minecraft before the school project, deliberately crossed the boundariesbetween school culture and gaming culture. She did this to enhance her technical abilitiesto the extent that she managed to create her own server—a rather complex task that manyof her peers struggled to achieve. In a different part of the interview, Elvira further clariﬁesthat she used her own server to host her classmates in her world during the school project.Excerpt 8, meanwhile, is interesting because Rita narrates how she learned about theexistence of communities of gamers sharing their gaming experiences through “Let’s Play”videos, which are video recordings of digital gameplay as it occurs, created by the playersthemselves. They often feature a commentary recorded by the player and constitute ahugely popular genre with millions of children watching Minecraft gameplay on YouTubeevery day [43].Excerpt 8 (Interview A)Rita: I know many YouTubers who do Minecraft. . .actually for my buildingsI took inspiration from some of them. . .well, like, I know a YouTuber who is\nEduc. Sci. 2024,14, 85 12 of 19very good at creating, he creates some works of art. . .like. . .well, so I got someideas to create my own buildings and so to say I discovered them [meaning theyoutubers] because while watching videos on YouTube then they appeared andso I watched a video.. and started watching some videos, and I liked them and soI subscribed and now I watch all of their videos.Notably, in Rita’s case, the YouTube algorithm effectively recognized Rita as a potentialaudience for “Let’s Play” videos and subsequently recommended a selection of such contentto her. Rita casually started watching some of these videos, and she found herself drawnto them to the extent that she opted to subscribe to several YouTube channels hosted bythese Youtubers, eagerly watching all the videos they produced. This noteworthy sequenceof events transpired as she clariﬁed in a different part of the interview, well in advanceof the start of the school project and prior to Rita’s initial direct engagement with theMinecraft platform. Consequently, when the teacher introduced the Minecraft project, Ritahad already acquired a substantial familiarity with the game through these videos, makingher enthusiastic about embarking on the school project involving Minecraft. Therefore,it is possible to infer that her familiarity with the “Let’s Play” genre developed over anextended period mediated her engagement with the school project.6.5. Boundary Crossing between School and LeisureThis category contains 14 excerpts in which the students discuss how they perceived asense of continuity or discontinuity between playing Minecraft for pedagogical tasks andfor leisure purposes and explain how continuity across the activities carried out in thesedifferent situations was created. In Excerpt 9, Valerio’s discourse shows that the activity inMinecraft led him to rethink his prior assumptions about the boundaries between schoolingand gaming. Indeed, he starts his turn of speech by stating that he never expected that agame could be part of a school activity. Then, both in this excerpt and in other parts of theinterview, his description of his experience of Minecraft is focused mainly on the senseof freedom and absence of “limits” perceived when playing the game, which seem to beopposed to what is usually experienced by him at school.Excerpt 9 (Interview E)Valerio: For me, it was cool because I didn’t think that school would introducea topic that was about something like a game. I mean, it’s not like. . .that theschool. . .usually do something like this. It was very interesting for me becausethere weren’t limits to our imagination. You could do whatever you wanted, andit was fun.In Excerpt 9, Valerio emphasizes the openness of the activities in Minecraft (“thereweren’t limits to our imagination”). This perception is probably connected both to theopen and ﬂexible environment provided by the game and to the open-ended nature of thetasks assigned by the teacher. This interpretation is supported also by the fact that in adifferent part of the interview, in disagreement with some of his peers who claimed that thetasks assigned by the teachers changed their experience of the game, Valerio emphasized asense of continuity between playing Minecraft for educational purposes and for leisure,stating explicitly that in his view, there were no differences between playing for leisure andengaging with a school task in Minecraft.In Excerpt 10, Carla describes her ﬁrst approach to Minecraft, stating that initially, itdid not capture her interest, but that the presentation of the game by the teacher made herchange her mind as she discovered that Minecraft is a “creative” game in which you haveto build and put a lot of dedication to complete the buildings. Her speech concludes withthe statement that before the school project, she did not understand why her peers likedthe game so much, but thanks to the school project she ﬁnally “understood”. We also knowfrom other parts of the interview that she enjoyed playing Minecraft for leisure purposes.Excerpt 10 (Interview H)\nEduc. Sci. 2024,14, 85 13 of 19Carla: well in reality Minecraft. . .well, I had heard about it almost. . .by manypeople, but in reality it never got my interest, but then when the teacher presentedit, then, well. . .then I understood that it is a game in which you have to build andyou need a lot of commitment for that and anyway it is a creative game and inreality I like these creative things, and so I liked the game. . .also because beforeI did not believe it was. . .I mean in reality before the people I know got crazyabout this game and I said: but why? I mean. . .I did not understand why with awith a game they got crazy. . . and then I understood. . .Excerpt 10 offers insights for two reasons. First, we place this excerpt within the“Brokers” category, speciﬁcally to underscore the pivotal role assumed by the teacherwithin the boundary-crossing process, as narrated by Carla. Her initial acquaintance withMinecraft stemmed from the widespread discussions among her peers who used the gamefor recreational purposes and expressed fervent enthusiasm for the game (“with a gamethey got crazy”). This interpretation is also validated by the fact that none of the studentsinvolved in the project had previously participated in any educational activity involvingMinecraft. However, a transformation occurred, primarily attributable to the mediatinginﬂuence of the teacher. Thanks to her teacher’s presentation of Minecraft, Carla recognizedthe educational value of Minecraft within the school setting and understood the reasonsbehind her peers’ intense enthusiasm for the game. This transformation suggests a notableshift in Carla’s perception of Minecraft, indicating that she started considering Minecraft asbeing valuable for both education and leisure.In the next section, we will illustrate how several students perceived the project inMinecraft as an interdisciplinary activity, intrinsically connected with different domainsof knowledge.6.6. Crossing Disciplinary BoundariesThe last category of our ﬁndings concerns the fact that Minecraft was experienced byseveral students as an interdisciplinary learning environment, where they felt they couldacquire knowledge and skills spanning across diverse domains and disciplines. Indeed,when exploring how they understood the educational value of the activities in Minecraft,in 11 excerpts the students displayed a high degree of metacognitive thinking, connectingtheir activities in Minecraft with their learning path in different disciplines, even though theproject pertained mainly to the history curriculum. In Excerpt 11, we present three speechturns from the same interview, in which two students discussed their interpretation of therole of Minecraft as an educational tool. First, Rosanna explained how she made sense ofthe links between Minecraft and the disciplines taught by the teacher leading the project.She claimed that the activities in Minecraft related to all the three disciplines of history,geography, and science taught by the teacher. Then, a few speech turns later, Grazianointervened, explaining how he used the stars in Minecraft to orientate as the shepherdsused to do in the past, and Rosanna further explained that in her view, Minecraft alsoinvolved mathematics because it is possible to use coordinates to move in the virtual world.Excerpt 11 (Interview B)Rosanna: I understood that Minecraft involved all the three disciplines of theteacher because anyway it could involve geography as we needed to orientatein the space we had available, history also looking at caves and how ancientpopulations lived and ancient types of buildings, and the sciences experimentingalso with potions and creating many scientiﬁc things, so I think it was a form ofdidactis more. . .I mean. . .it helped me to understand some things about history,science and geography[. . .]Graziano: so, I used the stars as a shepherd, that is, many times I rememberedthe position of my building because I looked at the sky and counted the starsmany times, the stars if you notice the stars many times, that is, there are. . .some\nEduc. Sci. 2024,14, 85 14 of 19numbers. . .I counted them because they are not, they are not thousands, theywill be about ten, sometimes even a twenty above you, as you walk the starseither increase or increase or they decrease, I knew how many stars there werenow, it’s not really a good explanation, but I wanted to explain. ..Rosanna: In my opinion, ehm, you can also do this, and. . .well. . .ehm. . .it alsoincludes mathematics by putting the coordinates, because you can also see thecoordinates, that is, where you are to track down. . .ehm. . .you can also useItalian, because there are also signs where you can write.In sum, Excerpt 11 effectively represents the sense of interdisciplinarity that wascommunicated by some of the students during the interviews. While a few studentsconnected the project to a single discipline (either history, science, or technology) andsome others did not mention any explicit connection between the school curriculum andthe activities in Minecraft, the ﬁndings show that the project had for many students thepotential to engage with activities that were relevant for their learning and not restricted tothe boundaries of a single discipline.6.7. Differences Depending on Previous ExperiencesTo examine potential differences among the six codes in the Crossing SocioculturalBoundaries category based on participants’ previous experience in Minecraft, a contingencytable (Table 3) was constructed, and subsequently, the chi-square test was performed.Table 3. Occurrence table of the six codes in the Crossing Sociocultural Boundaries category accordingto the level of expertise in Minecraft.Categories Disciplines Family-Edu Gaming-Edu Gender Leisure-Edu Social TOTExpertise OccurrencesNovice (n= 16)Observed 7 (64%) [25%] 3 (33%) [11%] 6 (75%) [21%] 1 (17%) [4%] 6 (43%) [21%] 5 (38%) [18%] 28Expected 5.05 4.13 3.67 2.75 6.43 5.97Residual 0.87 −0.56 1.21 −1.06 −0.17 −0.40Intermediate(n= 9)Observed 3 (27%) [15%] 4 (45%) [20%] 0 (0%) [0%] 5 (83%) [25%] 2 (14%) [10%] 6 (46%) [30%] 20Expected 3.61 2.95 2.62 1.97 4.59 4.26Residual −0.32 0.61 −1.62 2.16 −1.21 0.84Expert (n= 12)Observed 1 (9%) [8%] 2 (22%) [15%] 2 (25%) [15%] 0 (0%) [0%] 6 (43%) [46%] 2 (15%) [15%] 13Expected 2.34 1.92 1.70 1.28 2.98 2.77Residual −0.88 0.06 0.23 −1.13 1.75 −0.46TOT 11 9 8 6 14 13 61An initial descriptive analysis reveals that, with increasing experience, there is a gen-eral decline in the enactment of reported boundary-crossing events. Particularly noteworthyis the observation that novices predominantly display more boundary crossing, especiallyin the Disciplines and Gaming-education areas, while the Gender code is assigned to 83%of cases with intermediate experience in Minecraft. The Leisure code is evenly distributedamong novices and experts (43%), but much less so among intermediates (14%).More speciﬁcally, novices exhibit a higher amount of boundary crossing between dif-ferent Disciplines (25%), between Gaming and Education (21%), and between Leisure andEducation (21%), while intermediates primarily narrate boundary-crossing events relatedto the Social boundaries (30%) and Gender categories (25%). Experts are predominantlycoded for boundary crossing between Leisure and Education (46%) and do not engage inGender-related boundary crossing (0%).The results of the chi-square test, conducted using SPSS software (version #29.0.2.0),conﬁrm a non-uniform distribution of occurrences based on expertise level (χ(10) = 19.513;p< 0.05). Notably, residue analysis emphasizes that the Gender attribution for partici-pants with an intermediate level of expertise deviates most signiﬁcantly from expectations(residual = 2.16).\nEduc. Sci. 2024,14, 85 15 of 197. Discussion and ConclusionsIn this article, we have discussed how the use of Minecraft at school provided severaloccasions for crossing different kinds of socio-cultural boundaries, each bearing implica-tions for learning.First, we examined instances of boundary crossing in which some female studentsinitially perceived Minecraft as a “game for boys” or dismissed it as a “stupid game,”but later reevaluated their cultural perceptions and engaged in the pedagogical activity.Our study reveals how engagement with Minecraft played a pivotal role in challengingand transforming genre expectations and stereotypes, especially among female students.Encouraging the active participation of female students in video games that feature strongscientiﬁc elements, like Minecraft, holds great potential to stimulate girls’ interest in STEMsubjects, which in turn can have profound implications for their career choices [44].Second, our ﬁndings suggest that Minecraft can facilitate a process of osmosis betweenfamily and school cultures. Indeed, the study identiﬁed instances in which family membersacted as boundary-crossing brokers, promoting students’ engagement in the gamefuleducational activity, and aiding in the transition across socio-cultural boundaries. Thedata also include excerpts in which the boundary crossing leads to a transformation ofsociocultural barriers within the family context. Bearing in mind the speciﬁcity of theschool and the family contexts, previous boundary-crossing research has shown how inhomework situations students can experience how school and home norms may conﬂictor how particular subject matters are not necessarily valued at home (e.g., [45]). Thus, theosmosis across the school and home contexts is not self-evident, and people may cometo face contradictions between the various participations and perspectives typical of eachcontext, leading to the experience of discontinuity. In such cases, what one experiencesand learns in one context cannot be easily related to and may even conﬂict with what oneexperiences and learns in another context [16]. Interestingly, in our ﬁndings, the narrationof the project in Minecraft included several episodes in which the contradictions betweenthe cultural values and beliefs associated with the two contexts were overcome during theeducational project, suggesting that the open-ended collaborative activities in Minecraftallowed for a fruitful osmosis despite profound cultural differences.Third, we explored how the students’ interactions with Minecraft in an educationalsetting revealed episodes in which social barriers were overcome. Some students high-lighted the signiﬁcance of both the game’s features and the teaching strategies employedby their instructors in helping them to overcome social barriers encountered in variouscontexts. In this sense, as claimed by Thomas and Brown [46], the educational use of gamessuch as Minecraft can contribute to creating dialogic spaces. This aspect was particularlyrelevant in the present study because it took place during the COVID-19 pandemic, whichgenerated several barriers to the students’ social interaction [47,48]. Notably, in someof the excerpts within this category, the teacher emerged as a pivotal ﬁgure, effectivelyacting as a facilitator of social interaction. In general, our study underscores the signiﬁcantrole of teachers in the students’ narratives involving the overcoming of different types ofsocio-cultural boundaries. This observation aligns with the concept proposed by Oonk andcolleagues [49], advocating the incorporation of a “broker” role within the multifacetedproﬁle of contemporary educators. Brokers, according to these authors, are required to pos-sess a skill set centered around boundary-crossing competence, which entails the capabilityto proﬁciently handle, transition between, and combine various discourses and practicesacross social boundaries. In particular, when addressing the educational use of games,teachers have a crucial role in framing the computer game as a learning resource [50], thusbridging the boundaries between school and leisure which will be discussed as follows.Fourth, regarding boundary crossing between school and leisure, the study found thatMinecraft can create a sense of continuity across the activities carried out in these differentsituations. Some students reported a sense of freedom and an absence of “limits” whenplaying the game, communicating a sense of continuity between its usage for educationand leisure. The previous literature concerning this ﬁnding is mixed. Indeed, as shown\nEduc. Sci. 2024,14, 85 16 of 19by Squire [51], some students can feel uneasy when having to perform in school identi-ties that are usually enacted during gameplay in settings outside school. Nevertheless,Bergin [52] identiﬁed that school experiences can give rise to leisure interests that studentsindependently pursue outside of the school environment. In line with the previous liter-ature [11,25], our ﬁndings suggest that Minecraft can be considered as a ﬂexible artifactthat can be transformed into a learning resource. The project in Minecraft provided thestudents an opportunity to reconsider their sensemaking about what kind of activitiescan be associated with school activities, also thanks to the open-ended nature of the tasksassigned by the teacher. Indeed, our data show that the students perceived this kind of taskas meaningful and engaging.Fifth, our study sheds light on the intersection of school and gaming cultures withinthe context of Minecraft, particularly the inﬂuence of YouTubers and online resourceson students’ learning experiences. The excerpts analyzed in this category emphasize theevolving role of digital media, YouTubers, and gaming communities in shaping students’perceptions and abilities related to Minecraft. They also illustrate how online resources(such as Let’s Play videos) and gaming content can extend beyond recreational enter-tainment, contributing to educational experiences. Our data show that Let’s Play videosprovide opportunities for knowledge and skill exchange. These videos allow players tosee how others play the game, learn new strategies, and gain insights into the game’smechanics. Additionally, Let’s Play videos can foster a sense of community and belongingamong players, which can be important for social and emotional learning. Indeed, assuggested by Dezuanni [43], watching a Let’s Play video can be perceived as watching overa friend’s shoulder as they play a game and having fun in a social setting in which a friend’sgameplay fun is your fun. Let’s Play videos thus reﬂect the social nature of most videogameplay. Accordingly, Let’s Play videos and other forms of digital media may play a keyrole in shaping the participatory practices that take place around Minecraft and contributeto the ongoing scholarship on participatory culture.Sixth, our data show that many students experienced Minecraft as an interdisciplinarylearning environment, where they could acquire knowledge and skills spanning diversedomains and disciplines. This category highlights the potential of Minecraft to promoteinterdisciplinary learning and foster connections between different subjects. Even thoughthe previous literature suggests that educational activities based on games such as Minecraftmight promote the acquisition of a variety of soft skills and competencies, including 21st-century competencies [6,7,9], further research is needed to examine how the students makesense of their learning and deliberately draw trajectories of participations that cross theboundaries of the disciplines around which teaching is usually organized.Finally, the analysis shows that different types of boundary crossing are associatedwith different levels of expertise in Minecraft prior to the educational activity. Even thoughthis study presents several limitations, especially due to the small size of the sample,this result is interesting because it shows that the students’ previous experience has thepotential to affect the boundary-crossing processes taking place during the educational useof Minecraft. Indeed, in our case, the female students who had overcome cultural categoriesassociated with gender typically had had the opportunity to engage with Minecraft priorto the educational experience but had initially dropped it because of their perceptionof a cultural boundary. This boundary was afterwards then reconceptualized duringthe school project, triggering a process of boundary crossing. In addition, the fact thatexpert students often mention boundary crossing between leisure and education can beexplained considering that during the pedagogical activity, these students have revisitedtheir opinions about Minecraft only as an entertaining game and transformed the socialpositions enacted while playing (playing as a gamer vs. playing as a student).To conclude, digital games can be considered ﬂexible artifacts that may take on manydifferent meanings when taught and played across different contexts [25]. According toAtkins [53], games exist only in their dialogic relationship with a player, so the meaning ofgames is not static and given a priori. When the students make sense of the educational\nEduc. Sci. 2024,14, 85 17 of 19use of a game, both a sense of continuity and discontinuity can be perceived. The literatureshows that discontinuity can have negative consequences for educational trajectories interms of potential disengagement and drop-out. Hattam and Smyth [54], for example,describe the alienating experiences reported by students for whom maintaining an academicidentity proved to be impossible given their background, also leading to dropping out ofschool early. The present research, meanwhile, shows how the long-term use of Minecraftallowed for the emergence of many opportunities for boundary crossing, allowing thestudents to overcome many barriers and to socially construct a sense of continuity acrosscontexts and practices taking place in and outside of school.Author Contributions: Conceptualization, G.R.; methodology, G.R.; data collection, G.R.; dataanalysis, G.R. and R.M.; writing—original draft preparation, G.R.; writing—review and editing, R.M.All authors have read and agreed to the published version of the manuscript.Funding: Giuseppe Ritella’s work for this research was partially funded by the Finnish CulturalFoundation (grant number 00220876).Institutional Review Board Statement: Ethical review and approval was not requested for this studybecause the study did not possess the characteristics that require an ethical assessment, as outlined byResearch Ethics Committee in the Humanities and Social and Behavioural Sciences of the Universityof Helsinki.Informed Consent Statement: Informed consent was obtained from the parents of all the studentsinvolved in this study.Data Availability Statement: The data presented in this study are available upon request from thecorresponding author.Acknowledgments: The authors wish to thank Ivana Lorusso and Angela Ruotolo for their contribu-tion to the data collection and to the initial phase of the data analysis.Conﬂicts of Interest: The authors declare no conﬂicts of interest.References1.Gros, B. Digital Games in Education: The Design of Games-Based Learning Environments. J. Res. Technol. Educ. 2007,40, 23–38.[CrossRef]2. Nash, P.; Shaffer, D.W. Epistemic Trajectories: Mentoring in a Game Design Practicum. Instr. Sci. 2013,41, 745–771. [CrossRef]3.Arnseth, H.C.; Hanghøj, T.; Henriksen, T.D.; Misfeldt, M.; Ramberg, R.; Selander, S. Games and Education: Designs in and forLearning; Brill: Leiden, The Netherlands, 2018; Volume 2.4.Marlatt, R. Literary Analysis Using Minecraft: An Asian American Youth Crafts Her Literacy Identity. J. Adolesc. Adult Lit. 2018,62, 55–66. [CrossRef]5.Alawajee, O.; Delaﬁeld-Butt, J. Minecraft in Education Beneﬁts Learning and Social Engagement. Int. J. Game-Based Learn. 2021,11, 19–56. [CrossRef]6.Bile, A. Development of intellectual and scientiﬁc abilities through game-programming in Minecraft. Educ. Inf. Technol. 2022,27,7241–7256. [CrossRef] [PubMed]7.Carbonell-Carrera, C.; Jaeger, A.; Saorín, J.; Melián, D.; de la Torre-Cantero, J. Minecraft as a block building approach fordeveloping spatial skills. Enterteiment Comput. 2021,38, 100427. [CrossRef]8.Dezuanni, M. Minecraft and Children’s Digital Making: Implications for Media Literacy Education. Learn. Media Technol. 2018,43,236–249. [CrossRef]9.Hewett, K.J.; Zeng, G.; Pletcher, B.C. The Acquisition of 21st-Century Skills through Video Games: Minecraft Design ProcessModels and Their Web of Class Roles. Simul. Gaming 2020,51, 336–364. [CrossRef]10.Hanghøj, T.; Misfeldt, M.; Bundsgaard, J.; Fougt, S.S. Unpacking the Domains and Practices of Game-Oriented Learning. In Gamesand Education: Designs in and for Learning; Brill: Leiden, The Netherlands, 2019; pp. 29–46.11.Pettersen, K.; Arnseth, H.C.; Silseth, K. Playing Minecraft: Young Children’s Postdigital Play. J. Early Child. Lit. 2022, ﬁrst published.[CrossRef]12.Engeström, Y. Non Scolae Sed Vitae Discimus: Toward Overcoming the Encapsulation of School Learning. Learn. Instr. 1991,1,243–259. [CrossRef]13.Ito, M.; Gutiérrez, K.; Livingstone, S.; Penuel, B.; Rhodes, J.; Salen, K.; Watkins, S.C. Connected Learning: An Agenda for Research andDesign; Digital Media and Learning Research Hub: Irvine, CA, USA, 2013.14.Jornet, A.; Erstad, O. From Learning Contexts to Learning Lives: Studying Learning (Dis)Continuities from the Perspective of theLearners. Dig. Educ. Rev. 2018,33, 1–25. [CrossRef]\nEduc. Sci. 2024,14, 85 18 of 1915.Ritella, G.; Ligorio, M.B. Re-conceptualising the space–time of teachers’ professional development. In Re-Theorising Learning andResearch Methods in Learning Research; Routledge: New York, NY, USA, 2023; pp. 264–279.16.Bronkhorst, L.H.; Akkerman, S.F. At the Boundary of School: Continuity and Discontinuity in Learning across Contexts. Educ.Res. Rev. 2016,19, 18–35. [CrossRef]17. Barron, B. Conﬁgurations of Learning Settings and Networks. Hum. Dev. 2006,49, 229–231. [CrossRef]18. Akkerman, S.F.; Bakker, A. Boundary Crossing and Boundary Objects. Rev. Educ. Res. 2011,81, 132–169. [CrossRef]19.Engeström, Y. Learning by Expanding: An Activity-Theoretical Approach to Developmental Research; Orienta-Konsultit: Helsinki,Finland, 1987.20.Engeström, Y. Expansive Learning at Work: Toward an Activity Theoretical Reconceptualization. J. Educ. Work 2001,14, 133–156.[CrossRef]21. Lave, J.; Wenger, E. Situated Learning: Legitimate Peripheral Participation; Cambridge University Press: Cambridge, UK, 1991.22.Star, S.L. The Structure of Ill-Structured Solutions: Boundary Objects and Heterogeneous Distributed Problem Solving. InDistributed Artiﬁcial Intelligence; Morgan Kaufmann: Burlington, MA, USA, 1989; pp. 37–54.23.Aprea, C.; Cattaneo, A.A. Designing Technology-Enhanced Learning Environments in Vocational Education and Training. In TheWiley Handbook of Vocational Education and Training; John Wiley & Sons: Hoboken, NJ, USA, 2019; pp. 373–393.24.Cederqvist, A.M.; Impedovo, M. Minecraft as a Hybrid Boundary Object: Exploring Nature in Squares. Educ. Sci. 2023,13, 952.[CrossRef]25.Arnseth, H.C.; Hanghøj, T.; Silseth, K. Games as Tools for Dialogic Teaching and Learning: Outlining a Pedagogical Model forResearching and Designing Game-Based Learning Environments. In Games and Education: Designs in and for Learning; Brill: Leiden,The Netherlands, 2018; pp. 123–139.26.Bakker, A.; Akkerman, S. The Learning Potential of Boundary Crossing in the Vocational Curriculum. In The Wiley Handbook ofVocational Education and Training; John Wiley & Sons: Hoboken, NJ, USA, 2019; pp. 349–372.27.Akkerman, S.F.; Bruining, T. Multilevel Boundary Crossing in a Professional Development School Partnership. J. Learn. Sci. 2016,25, 240–284. [CrossRef]28.Akkerman, S.F.; Van Eijck, M. Re-theorising the Student Dialogically Across and Between Boundaries of Multiple Communities.Br. Educ. Res. J. 2013,39, 60–72. [CrossRef]29. Ritella, G.; Loperﬁdo, F.F. Students’ self-organization of the learning environment during a blended knowledge creation course.Educ. Sci. 2021,10, 580. [CrossRef]30.Ritella, G.; Rajala, A.; Renshaw, P. Using chronotope to research the space-time relations of learning and education: Dimensionsof the unit of analysis. Learn. Cult. Soc. Interact. 2021,31, 100381. [CrossRef]31.Engle, R.A. Framing Interactions to Foster Generative Learning: A Situative Explanation of Transfer in a Community of LearnersClassroom. J. Learn. Sci. 2006,15, 451–498. [CrossRef]32.Leander, K.M. ‘This Is Our Freedom Bus Going Home Right Now’: Producing and Hybridizing Space-Time Contexts inPedagogical Discourse. J. Lit. Res. 2001,33, 637–679. [CrossRef]33. Suchman, L. Working Relations of Technology Production and Use. Comput. Support. Cooper. Work 1994,2, 21–39. [CrossRef]34.Crowley, K.; Jacobs, M. Islands of Expertise and the Development of Family Scientiﬁc Literacy. In Learning Conversations Museums;Lawrence Erlbaum Associates: Mahwah, NJ, USA, 2002; pp. 333–356.35. Wenger, E. Communities of Practice. In Learning, Meaning, and Identity; Cambridge University Press: Cambridge, UK, 1998.36.Kilpatrick, S.; Cheers, B.; Gilles, M.; Taylor, J. Boundary Crossers, Communities, and Health: Exploring the Role of Rural HealthProfessionals. Health Place 2009,15, 284–290. [CrossRef] [PubMed]37.Engeström, Y.; Engeström, R.; Karkkainen, M. Polycontextuality and Boundary Crossing in Expert Cognition: Learning andProblem Solving in Complex Work Activities. Learn. Instr. 1995,5, 319–336. [CrossRef]38.Star, S.L.; Griesemer, J.R. Institutional Ecology, ‘Translations’ and Boundary Objects: Amateurs and Professionals in Berkeley’sMuseum of Vertebrate Zoology, 1907–1939. Soc. Stud. Sci. 1989,19, 387–420. [CrossRef]39.Clark, D.B.; Tanner-Smith, E.E.; Killingsworth, S.S. Digital Games, Design, and Learning: A Systematic Review and Meta-Analysis.Rev. Educ. Res. 2016,86, 79–122. [CrossRef] [PubMed]40. Mayan, M.J. Essentials of Qualitative Inquiry; Routledge: London, UK, 2016.41. Hsieh, H.F.; Shannon, S.E. Three Approaches to Qualitative Content Analysis. Qual. Health Res. 2005,15, 1277–1288. [CrossRef]42. Saldaña, J. The Coding Manual for Qualitative Researchers; SAGE: London, UK, 2021.43.Dezuanni, M. Peer Pedagogies on Digital Platforms: Learning with Minecraft Let’s Play Videos; MIT Press: Cambridge, MA, USA, 2020.44.Renninger, K.A.; Nieswandt, M.; Hidi, S. Interest in Mathematics and Science Learning; American Educational Research Association:Washington, DC, USA, 2015.45.Jackson, K. Approaching Participation in School-Based Mathematics as a Cross-Setting Phenomenon. J. Learn. Sci. 2011,20,111–150. [CrossRef]46. Thomas, D.; Brown, J.S. The Play of Imagination: Extending the Literary Mind. Games Cult. 2007,2, 149–172. [CrossRef]47.Silletti, F.; Ritella, G.; Iacobellis, B.; Semeraro, C.; Episcopo, E.; Cassibba, R.; Coppola, G. Distance learning in Higher Educationduring the ﬁrst pandemic lockdown: The point of view of students with special educational needs. Qwerty 2021. [CrossRef]48.Ritella, G.; Loperﬁdo, F.F.; De Giglio, G.; Scurani, A.; Ligorio, M.B. Adopting educational robotics and coding to open dialogicspaces in lower secondary education. Dialogic Pedagog. Int. Online J. 2022,10, 41–58. [CrossRef]\nEduc. Sci. 2024,14, 85 19 of 1949.Oonk, C.; Gulikers, J.T.M.; den Brok, P.J.; Wesselink, R. Teachers as Brokers: Adding a University-Society Perspective to HigherEducation Teacher Competence Proﬁles. High. Educ. 2020,80, 701–718. [CrossRef]50.Silseth, K. The Multivoicedness of Game Play: Exploring the Unfolding of a Student’s Learning Trajectory in a Gaming Context atSchool. Int. J. Comput.-Support. Collab. Learn. 2012,7, 63–84. [CrossRef]51. Squire, K. Changing the Game: What Happens When Video Games Enter the Classroom? Innov. J. Online Educ. 2005,1, 5.52.Bergin, D.A. Leisure Activity, Motivation, and Academic Achievement in High School Students. J. Leis. Res. 1992,24, 225–239.[CrossRef]53.Atkins, B. What Are We Really Looking at? The Future-Orientation of Video Game Play. Games Cult. 2006,1, 127–140. [CrossRef]54.Hattam, R.; Smyth, J. ‘Not Everyone Has a Perfect Life’: Becoming Somebody Without School. Pedagog. Cult. Soc. 2003,11,379–398. [CrossRef]Disclaimer/Publisher’s Note: The statements, opinions and data contained in all publications are solely those of the individualauthor(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the editor(s) disclaim responsibility for any injury topeople or property resulting from any ideas, methods, instructions or products referred to in the content."
    }
]